{
   "fungi":[
      {
         "commonName":"Apricot Jelly",
         "scientificName":"Guepinia helvelloides",
         "image":"http://www.ediblewildfood.com/images/apricot-jelly-pictures/Guepinia-helvelloides.jpg",
         "description":"Overview: The apricot jelly fungi is a widespread fungus easily recognized by its unique shape, rubbery texture, and orange to salmon-pink colouration. The taxonomy has a bit of a convoluted history, resulting in many older field guides listing this species as Phlogiotis helvelloides or Tremiscus helvelloides. It is a saprobic jelly fungus that is quite unique as it dries out, yet rehydrates repeatedly as the rains come and go. Interestingly, they produce a new set of spores each time they rehydrate.",
         "edibility":"Edibility: Some people claim this has a mild sweet taste, yet most people say it is without flavour. Although some people have eaten these raw, it is important to cook all fungi before eating.",
         "recipes":[
            {
               "recipeName":"Jelly Mushroom Soup",
               "recipeName_url":"http://www.moroccanfoodlovers.com/?page_id=2312"
            }
         ]
      },
      {
         "commonName":"Bear's Head Tooth",
         "scientificName":"Hericium americanum",
         "image":"http://www.ediblewildfood.com/images/bears-head-tooth-pictures/Hericium-americanum-1.jpg",
         "description":"Overview: Hericium americanum (Fam. Hericiaceae) is white when fresh and yellows with age. It has long spines and a branched fruiting body. The fungus is 15-30cm (6-12”) across. It is a tightly branched structure which develops from a rooted base. When young, before the branches have developed, it might be confused with Hericium erinaceus (which is also edible).",
         "edibility":"Edibility: Edible when young – be sure it is white. Mild nutty taste; cook before eating.",
         "recipes":[
            {
               "recipeName":"Roasted Lion's Mane Mushrooms with Champagne and Honey Mignonette",
               "recipeName_url":"http://chubbyvegetarian.blogspot.com/2013/11/roasted-lions-mane-mushrooms-with.html?m=1"
            }
         ]
      },
      {
         "commonName":"Birch Polypore",
         "scientificName":"Fomitopsis betulina",
         "image":"http://www.ediblewildfood.com/images/birch-polypore-pictures/Piptoporus-betulinus.jpg",
         "description":"Overview: Fomitopsis betulina (previously Piptoporus betulinus) is commonly found in countries around the world that have birch forests. This edible and medicial polypore has been extensively studied and there is ample evidence supporting the antibacterial, anti-parasitic, antiviral, anti-inflammatory, anticancer, neuroprotective, and immunomodulating activities. Birch polpores are a common basidiomycota brown rot macrofungus that grows on decaying birch trees. By the time the white fruiting body emerges, decay to the tree is extensive. In 1753 Carl Linnaeus first described this fungus and referred to it as Boletus suberosus, and later the French mycologist Jean Baptiste Francois (Pierre) Bulliard changed the specific epithet to betulinus - a reference to the birch trees (Betula spp.). In 1821, Bulliard transferred this very common and widespread polypore to the genus Polyporus, where it remained for sixty years. In 1881, Finnish mycologist Petter Adolf Karsten transferred the birch polypore to a new genus, Piptoporus, which he had created.",
         "edibility":"Edibility: Birch polypores are not known as being a culinary fungi however it can be used in a variety of ways. Young polypores can be sliced thin, marinated then roasted. Cut up and dried, they can be used as a tea although it isn't that great tasting. Dehydrating is a great way to preserve them long term (although exactly how long is not known). Once dehydrated they can be powdered, then add to any dish you prepare. Store in a cool, dark location once dehydrated.",
         "recipes":[
            {
               "recipeName":"Birch Polypore Tea",
               "recipeName_url":"https://www.youtube.com/watch?v=-VA89OUS1KE"
            }
         ]
      },
      {
         "commonName":"Chaga",
         "scientificName":"Inonotus obliquus",
         "image":"http://www.ediblewildfood.com/images/chaga-pictures/chaga.jpg",
         "description":"Overview: Chaga is perhaps the most sought-after and easily recognized fungi in the Hymenochaetaceae family. It is parasitic on birch and occasionally on other trees. This fungus causes white heart rot on several broad-leaved tree species. Chaga forms charcoal-black, sterile conks on infected (mostly) birch (Betula spp.) trees. The dark-coloured part of the sterile conk is formed by a pure mycelial mass of fungus. Typically, well-developed chaga are found on trees over 40 years of age.",
         "edibility":"Edibility: Chaga must be broken down into a powder form in order to be added into various meals. When broken into small pieces it can be used to make a nourishing tea. Both the exterior and interior parts of chaga is processed into powder form. Harvest from living trees only!",
         "recipes":[
            {
               "recipeName":"Chaga Tea and Tincture",
               "recipeName_url":"https://chagahq.com/prepare-chaga/"
            }
         ]
      },
      {
         "commonName":"Chanterelle",
         "scientificName":"Cantharellus cibarius",
         "image":"https://upload.wikimedia.org/wikipedia/commons/9/9a/Chanterelle_Cantharellus_cibarius.jpg",
         "description":"Overview: They are among the most popularly eaten species of wild mushrooms. They are orange, yellow or white, meaty and funnel-shaped. On the lower surface, underneath the smooth cap, most species have gill-like ridges that run almost all the way down its stipe, which tapers down seamlessly from the cap. Many species emit a fruity aroma, reminiscent of apricots, and often have a mildly peppery taste.",
         "edibility":"Edibility: There are many ways to cook chanterelles. Most of the flavorful compounds in chanterelles are fat-soluble, making them good mushrooms to sauté in butter, oil or cream. They also contain smaller amounts of water- and alcohol-soluble flavorings, which lend the mushrooms well to recipes involving wine or other cooking alcohols. Many popular methods of cooking chanterelles include them in sautés, soufflés, cream sauces, and soups",
         "recipes":[
            {
               "recipeName":"Chanterelle Mushroom and Leek Pizza",
               "recipeName_url":"https://www.thedailymeal.com/chanterelle-mushroom-and-leek-pizza-recipe"
            }
         ]
      },
      {
         "commonName":"Chicken Of The Woods",
         "scientificName":"Laetiporus sulphureus",
         "image":"http://www.ediblewildfood.com/images/chicken-of-the-woods-pictures/Laetiporus-sulphureus.jpg",
         "description":"Overview: Chicken of the woods is parasitic and saprobic on living and dead oaks (also sometimes on the wood of other hardwoods). It causes a reddish brown cubical heart rot, with thin areas of white mycelium visible in the cracks of the wood. It is considered an annual favourite. These mushrooms do not appear until well after the fungus has attacked the tree. Originally described in 1789 by French botanist and mycologist Jean Baptiste Francois (Pierre) Bulliard, this spectacular polypore was given its current name in 1920 by the famous American mycologist William Alphonso Murrill (1869 - 1967). This fungi typically grows in large clusters in the summer and fall.",
         "edibility":"Edibility: This mushroom is said to have a lemony, meaty taste. Some think it tastes like its chicken namesake; others describe the flavour as being more like crab or lobster-like. The margins of chicken of the woods is the desirable part to consume because the inner area tends to get a bit corky or in some cases woody and requires boiling in water for about an hour. Its look-a-like, Laetiporus cincinatus (pores are white and it grows from wood in the ground), is totally palatable. It’s important to note that this is one of those mushrooms that sometimes can cause gastric distress in certain people. If you want to avoid a possible stomach ache, only try a little bit your first time to see what it does to you. Be sure to cook before eating!",
         "recipes":[
            {
               "recipeName":"Sauted Chicken of the Woods",
               "recipeName_url":"https://www.washingtonpost.com/recipes/chicken-of-the-woods-mushrooms/12364/?utm_term=.c30e8a5bb20f"
            }
         ]
      },
      {
         "commonName":"Comb Tooth Fungus",
         "scientificName":"Hericium coralloides",
         "image":"http://www.ediblewildfood.com/images/comb-tooth-fungus-pictures/hericium-corallaoides-spines.jpg",
         "description":"Overview: Hericium coralloides was formerly known as Hericium ramosum so this name may come up in online searches. It is saprobic and possibly somewhat parasitic. This delicately beautiful fungus typically fruits on fallen logs or branches of hardwoods. Often they can be spotted in large patches that can be seen from quite some distance. This fungus is often misidentified as being Hericium erinaceus or Hericium americanum. Hericium americanum is more branched than Hericium erinaceus and grows from the wood of living trees and dead hardwoods.",
         "edibility":"Edibility: Edible when young; be sure it is white. Mild nutty taste; cook before eating. To harvest the comb tooth, the best method is to cut the fruit body at the base, close to the wood and thus remove it in one piece; it is fragile and will break apart quite easily. Many wild picked Hericium fungi may house various tiny beetles. Thoroughly clean by shaking and hand removal if needed. If the mushroom has begun to discolour to a yellowish tone, it is old and likely will have a sour or unpleasant flavour after cooking.",
         "recipes":[
            {
               "recipeName":"Roasted Lion's Mane Mushrooms with Sherried Shallots",
               "recipeName_url":"http://www.myrecipes.com/recipe/roasted-lions-mane-mushrooms"
            }
         ]
      },
      {
         "commonName":"Common Morel",
         "scientificName":"Morchella esculenta",
         "image":"http://www.ediblewildfood.com/images/common-morel-pictures/may-yellow-morels.jpg",
         "description":"Overview: Morels belong to the Morchella genus because they are part of the \"True Morels.\" The cap colour varies from pale cream, to ochre, to yellowish brown, sometimes slightly darkening with age. The ribs along the ridges between pits are usually slightly paler than the interior of the pits. Caps are tightly attached to the stem. Cut lengthwise it will be hollow from bottom of stem to top of cap; it looks like a rubber mold. The cap is longer than the stem. Most caps have a rounded cap with denser ridges yet some caps may have a more pointed cap appearance (still with the denser ridges).",
         "edibility":"Edibility: Always cook before consuming. They are usually enjoyed sauteed or added to favourite meals. In addition to being a sought-after food for us deer, elk and squirrels enjoy feasting on morels.",
         "recipes":[
            {
               "recipeName":"Morel Mushroom Sauce",
               "recipeName_url":"http://www.recipetips.com/recipe-cards/t--2121/morel-mushroom-sauce.asp"
            }
         ]
      },
      {
         "commonName":"Dark Stalked Bolete",
         "scientificName":"Leccinum atrostipitatum",
         "image":"http://www.ediblewildfood.com/images/dark-stalked-bolete-pictures/dark-stalked-bolete.jpg",
         "description":"Overview: This common bolete can be easily found in forests in which there are mostly deciduous trees, especially birches. Dark-stalked boletes are not a commonly sought-after edible fungi due to the lack of taste or scent. They can be found scattered or solitary.",
         "edibility":"Edibility: Always pick healthy-looking specimens and cook before consuming. Bake in oven or fry dry – added oils or butter will make these mushy. Do not eat in large quantities or frequently. This bolete does not have a distinctive taste nor scent.",
         "recipes":[
            {
               "recipeName":"Bolete Mushroom Soup",
               "recipeName_url":"https://www.frenchgirlcuisine.com/bolete-mushrooms-soup-recipe/"
            }
         ]
      },
      {
         "commonName":"Dryad's Saddle",
         "scientificName":"Polyporus squamosus",
         "image":"http://www.ediblewildfood.com/images/dryads-saddle-pictures/dryads-saddle-young.jpg",
         "description":"Overview: The disappointed morel hunter is usually never totally blanked as there are (typically) many dryad's saddle to be found. Foragers enjoy this edible springtime fungi as it is relatively common but depending on its age they become quite leathery making it virtually impossible to use in the kitchen. Dryad's saddle are much easier to find than morels because they stick out as shelves from the lower portion of dead tree trunks. First described scientifically in 1778 by English botanist William Hudson (1730 - 1793), who named it Boletus squamosus, this species was renamed Polyporus squamosus by Swedish mycologist Elias Magnus Fries in his 1821 Systema Mycologicum.",
         "edibility":"Edibility: Dryad's saddle is best when young and tender. So long as more mature specimens have white flesh they can be collected, dried and powdered or broken into very small pieces for use in soups or stews. The best rule to follow is to use your foraging knife and if you find that it is tough to remove it, then leave it. Younger dryad's saddle can be roasted or sauteed. They must be cooked before consumed. They have a mealy odour and taste, yet it is pleasant.",
         "recipes":[
            {
               "recipeName":"Dryad Saddle Ramen",
               "recipeName_url":"hhttp://foragerchef.com/dryad-saddle-ramen/"
            }
         ]
      },
      {
         "commonName":"Giant Puffball",
         "scientificName":"Calvatia gigantea",
         "image":"http://www.ediblewildfood.com/images/giant-puffball-pictures/giant-puffball-size.jpg",
         "description":"Overview: The giant puffball typically grows in width and height anywhere between 10 and 70 cm (about 4” to 27”) and can weigh several kilograms. It has and continues to be been a great source of food for many people worldwide. Historically, it was used by the Iroquois and Meskwaki for food. In addition to being a source of food for centuries, the giant puffball was valuable as a styptic dressing to stem the bleeding of wounds. The giant puffball can be found growing as a solitary entity, in small groups, and they have been known to form large circles.",
         "edibility":"Edibility: Always cook before eating or dehydrate. The taste is rather faint, yet there is a pleasant scent. Some simple rules must be followed before eating a giant puffball or any puffballs. The interior tissue must be uniformly white. If infested with insects/maggots it should be trimmed in order to avoid the infested parts. The outside skin is easily peeled and should not be eaten if it is tough, leathery, or dirty. Never wash the puffball with water as it will soak up water like a sponge and become very soggy. This and other edible puffballs can be stored for up to 5 days in the refrigerator without losing significant quality.",
         "recipes":[
            {
               "recipeName":"Multiple Recipes",
               "recipeName_url":"http://www.kitchenfrau.com/puffball-recipes/"
            }
         ]
      },
      {
         "commonName":"Late Fall Oyster",
         "scientificName":"Sarcomyxa serotina",
         "image":"http://www.ediblewildfood.com/images/late-fall-oyster-pictures/mukitake.jpg",
         "description":"Overview: Late fall oysters are often referred to as being the harbinger of the end of the mushroom season in late fall or winter depending on the geographic location. They tend to fruit in groups, either in clusters or single. Late fall oysters are reminiscent of the more common oyster mushrooms, yet their greenish colour sets them apart from the common oyster. They are also known as Panellus serotinus.",
         "edibility":"Edibility: In Japanese culture late fall oysters, or mukitake, is considered a very popular edible mushroom although it is not as common in North America. It dries well and is a great addition in a hearty stew. Its bitter flavour lends itself well to robust sauces. Although considered edible, it is quite tough and must be cooked a long time over low heat.",
         "recipes":[
            {
               "recipeName":"Pan-Seared Venison With Oyster Mushrooms",
               "recipeName_url":"https://www.sevendaysvt.com/BiteClub/archives/2015/11/24/farmers-market-kitchen-pan-seared-venison-with-oyster-mushrooms"
            }
         ]
      },
      {
         "commonName":"Lobster Mushroom",
         "scientificName":"Hypomyces lactifluorum",
         "image":"http://www.ediblewildfood.com/images/lobster-mushroom-pictures/lobster-mushroom-picture.jpg",
         "description":"Overview: The overall look is that of a capped mushroom (which contorts with age) covered with a finely bumpy, vivid orange to orange-red layer. The gills of the host mushroom can be entirely obscured by this parasite. It will still produce spores, but only those of Hypomyces Lactifluorum. These emanate from countless reddish-orange perithecial mounds (pimples) which dot the surface at maturity.",
         "edibility":"Edibility: Russula brevipes and Lactarius piperatus are the host mushrooms in which Hypomyces lactifluorum is created rendering this edible. Be sure you have properly identified this mushroom before picking. Be sure the inside “meat” is white and always cook thoroughly before consuming.",
         "recipes":[
            {
               "recipeName":"Braised Lobster Mushroom With Wild Spinach and Wheatberries",
               "recipeName_url":"http://foragerchef.com/braised-lobster-mushroom-in-its-jus-with-wild-spinach-and-wheatberries/"
            }
         ]
      },
      {
         "commonName":"Old Man Of The Woods",
         "scientificName":"Strobilomyces floccopus",
         "image":"http://www.ediblewildfood.com/images/old-man-of-the-woods-pictures/old-man-of-the-woods.jpg",
         "description":"Overview: This is one of North America's most unusual edible wild mushroom. It is a dark, scurfy fungus that is gray-white with tufts of black hair on the cap and a fine layer of dark fur on the mushroom's stem.",
         "edibility":"Edibility: Young fungi must be cooked. They have a mellow, earthy flavour.",
         "recipes":[
            {
               "recipeName":"Cajun Braised Venison with Mushrooms, and Dark Brown Gravy",
               "recipeName_url":"https://greatoutdoordinary.com/2017/06/25/old-man-of-the-woods-mushroom-recipe-cajun-braised-venison-with-mushrooms-and-dark-brown-gravy/"
            }
         ]
      },
      {
         "commonName":"Oyster Mushroom",
         "scientificName":"Pleurotus ostreatus",
         "image":"http://www.ediblewildfood.com/images/oyster-mushroom-pictures/young-oyster-mushrooms.jpg",
         "description":"Overview: This mushroom is close relative to the King Oyster mushroom. The Japanese call it Hiratake, which means the ‘flat mushroom’. Amazingly, the oyster mushroom is also carnivorous with its victim being the nematode, an animal that is itself parasitic.",
         "edibility":"Edibility: Oyster mushrooms have a delicate, mild flavour with a velvety texture. Can be eaten raw or cooked although raw means that it probably won’t digest properly.",
         "recipes":[
            {
               "recipeName":"Oyster mushrooms, garlic, and green onions saute",
               "recipeName_url":"https://juliasalbum.com/oyster-mushrooms-garlic-and-green-onions-saute-paleo-gluten-free/"
            }
         ]
      },
      {
         "commonName":"Pig's Ear",
         "scientificName":"Gomphus clavatus",
         "image":"http://www.ediblewildfood.com/images/pigs-ear-pictures/pigs-ear-distribution-map.jpg",
         "description":"Overview: Pig's ear fungi has a mycorrhizal relationship with mainly coniferous trees such as fir and spruce but also with some deciduous trees such as beech trees. The hyphae of the fungus are closely associated with the roots of the tree and both species gain from this relationship. Gomphus clavatus is in the Cantharellaceae family. Extracts prepared from Gomphus clavatus fruit bodies have a high antioxidant activity, and a high concentration of phenolic and flavonoid compounds. Phenolic compounds identified from the fungus include protocatechuic acid, gallic acid, gentisic acid, vanillic acid, syringic acid, cinnamic acid, caffeic acid, ferulic acid, and tannic acid.",
         "edibility":"Edibility: Pig's ears are truly exceptional mushrooms. They have a very firm and meaty texture, which holds up well in soups, sauces, and baked dishes. They have a great musty and earthy aroma and taste really nice. As all wild fungi, they must be cooked.",
         "recipes":[
            {
               "recipeName":"Italian Marinated Mushrooms",
               "recipeName_url":"https://honest-food.net/italian-marinated-mushrooms-recipe/"
            }
         ]
      },
      {
         "commonName":"Porcini",
         "scientificName":"Boletus edulis",
         "image":"https://upload.wikimedia.org/wikipedia/commons/b/b0/Boletus_edulis_EtgHollande_041031_091.jpg",
         "description":"Overview: The fungus grows in deciduous and coniferous forests and tree plantations, forming symbiotic ectomycorrhizal associations with living trees by enveloping the tree's underground roots with sheaths of fungal tissue. The fungus produces spore-bearing fruit bodies above ground in summer and autumn. The fruit body has a large brown cap which on occasion can reach 35 cm (14 in) in diameter and 3 kg (6.6 lb) in weight.",
         "edibility":"Edibility: The flavour has been described as nutty and slightly meaty, with a smooth, creamy texture, and a distinctive aroma reminiscent of sourdough. Young, small porcini are most appreciated by gourmets, as the large ones often harbour maggots (insect larvae), and become slimy, soft and less tasty with age. Fruit bodies are collected by holding the stipe near the base and twisting gently. Cutting the stipe with a knife may risk the part left behind rotting and the mycelium being destroyed. Peeling and washing are not recommended.",
         "recipes":[
            {
               "recipeName":"Italian Marinated Mushrooms",
               "recipeName_url":"https://honest-food.net/italian-marinated-mushrooms-recipe/"
            }
         ]
      },
      {
         "commonName":"Resinous Polypore",
         "scientificName":"Ischnoderma resinosum",
         "image":"http://www.ediblewildfood.com/images/resinous-polypore-pictures/resinous-polypores-side-view.jpg",
         "description":"Overview: This fungi occurs singly or in groups on fallen hardwood tree trunks and branches sometimes in overlapping clusters. It causes a white to yellow rot of the trees that separates the annual rings in the wood and often smells like anise. They can fruit until the first hard freeze.",
         "edibility":"Edibility: This fungi is said to be edible when young due to high water content; although edible this is not necessarily palatable. They become cork-like with age and inedible.",
         "recipes":[
            {
               "recipeName":"Ischnoderma Mushroom Conserve",
               "recipeName_url":"http://foragerchef.com/resinous-polypore-ischnoderma-resinosum/"
            }
         ]
      },
      {
         "commonName":"Sidewalk Mushroom",
         "scientificName":"Agaricus bitorquis",
         "image":"http://www.ediblewildfood.com/images/sidewalk-mushroom-pictures/sidewalk-mushroom-gills.jpg",
         "description":"Overview: Agaricus bitorquis is a choice edible white mushroom of the genus Agaricus which is similar to the common button mushroom that is sold commercially. It gets its common name from the habit of where it likes to grow, usually by sidewalks, but remarkably it can grow through asphalt. Usually in groups their size, they are quite sturdy and relatively easy to identify. They do not turn yellow on bruising or cutting which rules out the poisonous Yellow Stainer (Agaricus xanthodermus) in the same family. The specific epithet bitorquis is Latin meaning \"having two collars\", and refers to the two rings resulting from detachment of the annulus from both the top and bottom of the stipe.",
         "edibility":"Edibility: Excellent when baked/cooked. It is a substantial size, has firm texture, and and excellent flavour making this one of the best Agaricus species for consumption.",
         "recipes":[
            {
               "recipeName":"",
               "recipeName_url":""
            }
         ]
      },
      {
         "commonName":"Tinder Hoof",
         "scientificName":"Fomes fomentarius",
         "image":"http://www.ediblewildfood.com/images/tinder-hoof-pictures/tinder-hoof.jpg",
         "description":"Overview: Fomes fomentarius occurs throughout much of the northern hemisphere and in some parts of the southern hemisphere with the ability to live up to thirty years under optimum conditions. It is geotropic meaning it grows down. Tinder hoof has been recognized throughout the centuries for medicinal uses. It is known as a means to boost immunity, enhance blood circulation, regulate blood sugar and lower blood pressure.",
         "edibility":"Edibility: It is far too hard to eat so you must break it up and make tea with the smaller pieces. You can also grind into a powder and add it to soups or coffee for added nutrients.",
         "recipes":[
            {
               "recipeName":"Tinder Fungus Tea",
               "recipeName_url":"https://www.neeach.com/fungal-tea-tinder-fungus-as-an-alternative-to-your-usual-brew/1934/"
            }
         ]
      },
      {
         "commonName":"Turkey Tail",
         "scientificName":"Trametes versicolor",
         "image":"http://www.ediblewildfood.com/images/turkey-tail-pictures/turkey-tails.jpg",
         "description":"Overview: Turkey tails are one of the most common fungi in Canada and throughout the U.S. It is found virtually anywhere there are dead hardwood logs. Its cap colours are quite variable with sharply contrasting concentric zones of colour. They typically grow in rows or overlapping shelves. In Chinese medicine it is referred to as yun zhi, and the Japanese name is kawaratake. This fungi is full of a protein-bound molecule known as PSK, or polysaccharide K. Many polysaccharides (including PSK) have been shown to boost the immune system to fight infection and many different types of cancers.",
         "edibility":"Edibility: This fungi is not palatable due to its tough texture. When fresh it is best used as a tea. Collecting turkey tails and drying them out is recommended. Once dried they can still be used to make tea, add to other teas, used in soups and in other meals. According to www.midwestmycology.org: \"There are, however, no poisonous species of Trametes anywhere in the world, and most have medicinal properties.",
         "recipes":[
            {
               "recipeName":"Turkey Tail Tea",
               "recipeName_url":"https://foragedfoodie.blogspot.com/2016/11/preserving-turkey-tail-mushrooms.html"
            }
         ]
      },
      {
         "commonName":"Velvet Shank",
         "scientificName":"Flammulina velutipes",
         "image":"http://www.ediblewildfood.com/images/velvet-shank-pictures/velvet-shank-gills.jpg",
         "description":"Overview: Velvet Shank are often seen fruiting throughout light snowfall and is even known to continue growth after it has thawed from freezing. These mushrooms are the wild alternative to the cultivated form, enoki. Enoki mushrooms are found in grocery stores and are also called enokitake. Enoki is white, long-stemmed, and tiny-capped (image appears in the images). Extracts from this mushroom show exceptionally high anti-cancer activity, and an epidemiology survey of Flammulina velutipes farmers in Japan found that the mushroom farmers had lower rates of cancer deaths than people who were not involved in mushroom farming.",
         "edibility":"Edibility: Stems are generally too tough for eating but the caps can be used in soups, stews, as well as in casseroles. They must always be cooked. It is believed to remove the skin of the cap before cooking as it is supposedly not easily digested. These mushrooms are considered tasty, with a sweet, mealy flavour. Enoki stems and caps are edible and have a pleasant taste.",
         "recipes":[
            {
               "recipeName":"Sukiyaki",
               "recipeName_url":"https://www.akafuji.co.jp/andjapanrice/english/recipe/04.html"
            }
         ]
      }
   ]
}
