{
   "weeds":[
      {
         "commonName":"Alfalfa",
         "scientificName":"Medicago sativa",
         "image":"http://www.ediblewildfood.com/images/alfalfa-pictures/alfalfa.jpg",
         "description":"Alfalfa has been around for centuries and is an overlooked wonder food. It is helpful for just about all kinds of health problems, especially those caused by nutritional deficiencies. Historically, the benefits of alfalfa were discovered centuries ago by Arabian horsemen who, upon feeding this wild edible to their livestock, noticed a jump in energy and performance. People who eat alfalfa report similar benefits. Many medical naturopathic doctors and alternative health professionals state that alfalfa is not only nutritious, it is an effective remedy for many ailments and it is used in the treatment for alcoholism and drug dependency.",
         "edibleParts":"Edible parts: Leaves and young shoots can be eaten raw or cooked. The leaves can also be dried for later use as a tea or tossed into soups. A very nutritious food in moderation, though it can trigger attacks in patients with systemic lupus erythematosus. The seed is commonly used as a sprouted seed which is added to salads, used in sandwiches, added to soups or eaten as is. Alfalfa seeds can also be ground into a powder and mixed with cereal flours for making nutritionally improved breads and other baked goods. An appetite-stimulating tea is made from the leaves and can be sweetened with honey.",
         "recipes":[
            {
               "recipeName":"B17 Soup",
               "recipeName_url":"http://www.ediblewildfood.com/b17-soup.aspx"
            }
         ]
      },
      {
         "commonName":"Arrowhead",
         "scientificName":"Sagittaria latifolia",
         "image":"http://www.ediblewildfood.com/images/arrowhead-pictures/waputo-flowers.jpg",
         "description":"Broadleaf arrowhead, also referred to as the common arrowhead, is a perennial aquatic plant in the Alismataceae (water plantain) family. Although this plant occurs naturally in many areas, it is also a sought-after aquatic plant that is cultivated by those who have ponds or waterways on their property. The common names of duck potato and wapato for this plant are in reference to the enlarged rounded starchy golf ball-sized tubers that form at the ends of underground plant runners (rhizomes). When dislodged from the mud, these tubers float to the surface.",
         "edibleParts":"Edible parts: The tubers of the arrowheads are edible when roasted or boiled. They were important food sources of indigenous peoples and in some areas are still valued as a great food source. Tubers are typically roasted. Though the skin is edible arrowhead tubers are more palatable when peeled. The best time for collecting tubers is in fall or early spring. Tubers are high in starch and phosphorous.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Bearberry",
         "scientificName":"Arctostaphylos uva-ursi",
         "image":"http://www.ediblewildfood.com/images/bearberry-pictures/kinnikinnick-flowers.jpg",
         "description":"Bearberry is known as Kinnikinnick which is pronounced KINNY-kin-ICK, or Kinn-ICK-innick, and is belived to come from the Alonquin meaning “smoking mixture.” Bearberry comes from its genus Arctostaphylos, from the Greek word for bear – Arktos and staphylos – a bunch of grapes, which its berries resemble. The species name of uva-ursi is apparently from the Latin uva (grape) and ursus (bear). Bearberries look like lingonberries (Vaccinium vitis-idaea), but they are not related. Lingonberry’s stems are erect: bearberry is limply creeping and only the tips of the stems are slightly ascending. Bearberry’s leaves are narrower and gradually tapering towards the base.",
         "edibleParts":"Edible parts: The bright red berries are edible and young leaves are often used as tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Bitter Dock",
         "scientificName":"Rumex obtusifolius",
         "image":"http://www.ediblewildfood.com/images/bitter-dock-pictures/Rumex_obtusifolius_drawing.jpg",
         "description":"Bitter dock is a perennial herbaceous plant that is found in many countries. It is a member of the Polygonaceae (buckwheat or dock) family. This plant has a long taproot that enables it survive long drought periods and out competes other vegetation. Although bitter dock seedlings find it difficult to flourish under competitive conditions, fully grown plants are able to endure being trodden over and mowed. Shortly after this plant has been trampled or mowed, it sends up new shoots and frequent rejuvenation may even result. During winter months, bitter dock coils up having undersized shady leaves and a solid taproot. Once the cold temperatures have ended, bitter dock quickly produces new leaves.",
         "edibleParts":"Edible parts: Young leaves are edible fresh or cooked. These leaves do have a bitter taste, especially the older they become. Some people will cook leaves in at least one change of water in order to reduce the bitterness. They can also be dried for later use. Young stems can be consumed as well but are preferred cooked by those who enjoy them. Seeds can be used raw or cooked. Like yellow dock, the seed can also be ground into a powder and used in baking although it is more time consuming to harvest.",
         "recipes":[
            {
               "recipeName":"Belgium Wild Beer",
               "recipeName_url":"http://www.ediblewildfood.com/belgium-wild-beer.aspx"
            }
         ]
      },
      {
         "commonName":"Blue Vervain",
         "scientificName":"Verbena hastata",
         "image":"http://www.ediblewildfood.com/images/blue-vervain-pictures/blue-vervain.jpg",
         "description":"Warning: blue vervain can interfere with blood pressure medication and hormone therapy. Do not eat any part of this plant if this applies to you! Also, large doses can induce vomiting and diarrhea.\nBlue vervain is a flowering plant in the Verbenaceae (vervain) family that not only grows wild, but it is a favourite choice in landscaped gardens. This is a perennial wildflower that is unique because it has flowers on showy candelabra-like spikes. Bees are among the important pollinators for this plant. In ancient times the plant was thought to be a cure-all among medicinal plants and the genus name is Latin for sacred plant.",
         "edibleParts":"Edible parts: Blue vervain had many uses in First Nation’s culture as food and medicine. The seed are edible when roasted and is ground into a powder (although they are somewhat bitter to taste). Leaves can be made into a tea or tossed into salads, soups, etc. The root can be collected all year round. The flowers can be tossed on top of a salad and eaten. (Dried, powdered flowers were once used as a snuff for nosebleeds.)\nExternally, this plant can be used as a poultice to help heal wounds and hemorrhoids. Internally the leaves and roots are a valuable alternative medicine used by medical herbalists for their patients as an antidiarrheal, analgesic, anthelmintic, antiperiodic, astringen",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Bluebead",
         "scientificName":"Clintonia borealis",
         "image":"http://www.ediblewildfood.com/images/bluebead-pictures/clintonia-borealis.jpg",
         "description":"Blue bead lily is a perennial plant that is a member of the Liliaceae family. This boreal plant also known by many names such as: Blue Bead Lily, Clintonia, Clinton’s Lily, Corn Lily, Snakeberry, Dogberry, and Cow Tongue. Bluebead was named after DeWitt Clinton (1769-1828), naturalist and once New York governor. This plant reproduces by seed and vegetatively by rhizomes division hence the reason there are many of these plants in some areas. Bluebead is native to boreal forests of eastern North America. One colony of bluebeads often covers several hundred square meters; yet few plants can actually establish new colonies",
         "edibleParts":"Edible parts: Young leaves are edible raw or cooked. This is best harvested in spring before the leaves unfurl. Older leaves can be used as a potherb. NEVER consume any other part of this plant!",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Borage",
         "scientificName":"Borago officinalis",
         "image":"http://www.ediblewildfood.com/images/borage-pictures/borage.jpg",
         "description":"Borage is a hardy annual edible that is known for its beauty. It’s a domestic herbal remedy that has been used since ancient times. Some people use borage as a substitute for valerian as it dispels melancholy and induces euphoria. Borage has a beneficial effect on the heart, adrenal glands, kidneys and the entire digestive system. It has been used as a cure for jaundice. This beautiful plant works well as a companion plant as it deters tomato hornworm and Japanese beetles; it also stimulates the growth of strawberries.",
         "edibleParts":"Edible parts: Leaves have been traditionally used to make a tea to rid the body of a fever. Although they can be cooked eating them raw is not recommended due to the ‘prickles’ it is best not to. Flowers are very tasty and can be tossed into salads or they can be crystallized to make a “candy.” The seeds are a rich source of gamma-linolenic acid; this oil helps to regulate the hormonal systems and lowers blood pressure. An edible blue dye can be obtained from the flowers; some people use it to colour vinegar however it turns pink on contact with acids.",
         "recipes":[
            {
               "recipeName":"Crystallized Borage",
               "recipeName_url":"http://www.ediblewildfood.com/crystallized-borage.aspx"
            }
         ]
      },
      {
         "commonName":"Bracted Orache",
         "scientificName":"Atriplex glabriuscula Edmondston",
         "image":"http://www.ediblewildfood.com/images/bracted-orache-pictures/mealy-leaf-bracted-orache.jpg",
         "description":"Bracted orache is an annual plant in the Chenopodiaceae family that resembles lamb's quarters in growth form. It tolerates the harsh maritime locations around the northern Atlantic Ocean. There are many plants in the genus Atriplex making the taxonomy extremely difficult, and remains in a state of flux. Compounding the problem is the fact that even specialists tend to have trouble identifying individual specimens. The good news is that they are all edible. The species name glabriuscula comes from the Latin glaber and means 'who become bald'. This plant is wind pollinated.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw (in small quantities) or cooked. Seeds can be ground into a meal and used as a thickener or mixed with flour in making bread.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Broadleaf Plantain",
         "scientificName":"Plantago major",
         "image":"http://www.ediblewildfood.com/images/broadleaf-plantain-pictures/broadleaf-plantain.jpg",
         "description":"Broadleaf Plantain is a perennial broadleaf plant that grows in many locations from spring to autumn. Not only is this a vital wild edible plant for overall good health, this wild weed can be used to treat chronic diarrhea as well as digestive tract disorders. Broadleaf plantain is packed with nutrients and is safe to ingest. If a person chomps on some fresh leaves, these can be applied to the skin to treat minor burns, insect bites or open wounds.",
         "edibleParts":"Edible parts: The entire plant. Young leaves can be eaten raw or cooked. They are somewhat bitter and tedious to prepare because it’s generally preferable (though not required) to remove the fibrous strands before use. Many people blanch the leaves in boiling water before using them in salads in order to make them more tender. Once blanched, plantain can be frozen then used later in a sauté, soup or stew. Seeds can be eaten raw or cooked and can be tedious to harvest. The seed can be ground into a meal and mixed with flour. Dried leaves make a healthy herbal tea.",
         "recipes":[
            {
               "recipeName":"Wild Pizza",
               "recipeName_url":"http://www.ediblewildfood.com/wild-pizza.aspx"
            }
         ]
      },
      {
         "commonName":"Bugleweed",
         "scientificName":"Ajuga reptans",
         "image":"http://www.ediblewildfood.com/images/bugleweed-pictures/bugleweed-stem.jpg",
         "description":"Bugleweed is in the Lamiaceae (mint) family and is native to north-western Africa (Algeria and Tunisia), Europe and western Asia (Iran, northern Turkey, Azerbaijan, Georgia and southern Russia). This is an evergreen perennial that grows at a slow rate. It has a long history of use to help with wounds, and is used in ointments and medicated oils.",
         "edibleParts":"Edible parts: Young shoots can be eaten in salads or sautéed. Young leaves are also edible; use in salads, teas, casseroles, etc.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Bull Thistle",
         "scientificName":"Cirsium vulgare",
         "image":"http://www.ediblewildfood.com/images/bull-thistle-pictures/bull-thistle.jpg",
         "description":"Bull thistles have earned the title of noxious or invasive in many areas. They are distinguished from all other thistles by the covering of short, sharp prickles on the upper, dark green surface of the leaf blade. It is these prickles that make the surface very harsh to the touch. Like many other plants, the bull thistle grows a rosette in its first year and blooms in its second year of life.",
         "edibleParts":"Edible parts: Bull thistle root can be eaten and is best used when mixed with other vegetables. Young flower stems can be cooked and young leaves can be eaten in a salad or tossed into a sauté. The taste is somewhat bland but the prickles MUST BE removed from the leaves before the leaves can be eaten! The flower buds can be cooked and used like globe artichokes, but they are smaller. Bull thistle seeds can be roasted. (Bull thistle root is rich in inulin.)",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Burdock",
         "scientificName":"Arctium lappa",
         "image":"http://www.ediblewildfood.com/images/burdock-pictures/burdock.jpg",
         "description":"Recognized mainly for its burrs, burdock is an interesting biennial plant because it consists primarily of carbohydrates, volatile oils, plant sterols, tannins, and fatty oils. Researchers aren't sure which active ingredients in burdock root are responsible for its healing properties, but this plant may have anti-inflammatory and antibacterial effects. In fact, recent studies show that burdock contains phenolic acids, quercetin and luteolin - all are powerful antioxidants. Burdock, in its first year has no stem and grows only as a basal rosette of leaves that stays close to the ground the first year and the beginning of the second.",
         "edibleParts":"Edible parts: First-year roots and second-year stems can be cooked by boiling for about 20 minutes, then season to taste. Before cooking however, the stems should be peeled, and roots scrubbed in order to remove the bitter rind. Immature flower stalks may also be harvested in late spring, before flowers appear; their taste resembles that of artichoke. The Japanese have been known to eat the leaves when a plant is young and leaves are soft.",
         "recipes":[
            {
               "recipeName":"Burdock Tonic Tea",
               "recipeName_url":"http://www.ediblewildfood.com/burdock-tonic-tea.aspx"
            }
         ]
      },
      {
         "commonName":"Catnip",
         "scientificName":"Nepata cataria",
         "image":"http://www.ediblewildfood.com/images/catnip-pictures/catnip.jpg",
         "description":"Catnip is a perennial herb that is native to Europe and Asia but also grows throughout North America and Africa. Both the Latin name and scientific names are derived from the inability of cats to resist the aroma of this plant. Cats get frisky when they eat this plant yet humans find it relaxing. It has been used for centuries in herbal remedies and as a relaxing tea.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw. Their mint-like flavour adds an aromatic flavouring in salads. Older leaves can be used as flavouring in cooked foods. Catnip leaves and flowers can be used fresh or dried to make a calming herbal tea. If making tea, it should be infused in a closed container in order to preserve the essential oils. Seeds and roots can also be used.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Cattail",
         "scientificName":"Typha latifolia",
         "image":"http://www.ediblewildfood.com/images/cattail-pictures/new-cattail-growth.jpg",
         "description":"The cattail is one of the most important and most common wild foods that also boast a variety of uses at different times of the year. Cattails (aka bulrushes) can be used to make mats, baskets, and the cigar-shaped head can even be used as packing material. Dipping the head in oil or fat, they can be used as torches. Aboriginals used the roots to make flour (high in protein and carbohydrates) and the fluffy wool of the head was used as diapers because of its softness and absorbency. The fluffy wool is similar to down and can be used as insulation in clothing, pillows, mattresses, quilts, and life jackets. These “cigar-heads” are also excellent fire started. The tight heads are often dry inside even after a heavy rain, making this essential survival tinder. Inside the stalks of fresh shoots is tasty food that can be eaten as is, sautéed or tossed into a stir fry.",
         "edibleParts":"Edible parts: The lower parts of the leaves can be used in a salad; the young stems can be eaten raw or boiled; the young flowers (cattails) can be roasted. Yellow pollen (appears mid-summer) of the cattail can be added to pancakes for added nutrients. Shake the pollen into a paper bag and use it as a thickener in soups and stews or mix it with flour for some great tasting bread. The root can be dried and pounded to make nutritious flour. Young shoots can be prepared like asparagus but requires longer cooking time to make them tender. Added to soup towards the end of cooking, they retain a refreshing crunchiness. They're superb in stir-fry dishes and excellent in virtually any context.",
         "recipes":[
            {
               "recipeName":"Honey Cattail Cookies",
               "recipeName_url":"http://www.ediblewildfood.com/honey-cattail-cookies.aspx"
            }
         ]
      },
      {
         "commonName":"Chamomile",
         "scientificName":"Matricaria recutita",
         "image":"http://www.ediblewildfood.com/images/chamomile-pictures/chamomile.jpg",
         "description":"Chamomile is definitely one of the most popular wild medicinal plants that can be eaten. The two main types of chamomile are the more popular German chamomile and Roman chamomile (Chamaemelum nobile). Although they belong to different species, they are used to treat the same health ailments in herbal pharmacy. Both are used to calm frayed nerves, help in soothing various stomach problems, reduce muscle spasms, and to treat several skin conditions. German chamomile grows in many countries.",
         "edibleParts":"Edible parts: The chamomile leaves and flowers are edible and they differ in taste. Chamomile flowers have a slight apple taste. Both can be tossed into a salad or a mug to make fresh chamomile herbal tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Chickweed",
         "scientificName":"Stellaria media",
         "image":"http://www.ediblewildfood.com/images/chickweed-pictures/chickweed.jpg",
         "description":"Chickweed is an annual wild edible that grows in many locations and as hardy as it is, chickweed is quite delicate. This is an easy-to-grow plant that’s healthy to eat and it produces flowers throughout the growing season even in hot, dry conditions. Chickweed is multi-functional because its presence decreases insect damage to other plants. This plant has a lot of health benefits and is full of vitamins, minerals and other essential nutrients.",
         "edibleParts":"Edible parts: Chickweed leaves are used by adding them raw to salads and sandwiches. They can be tossed into soups and stews as well. When adding to a cooked dish, the stems and flowers can be used also.",
         "recipes":[
            {
               "recipeName":"Chickweed Salad",
               "recipeName_url":"http://www.ediblewildfood.com/chickweed-salad.aspx"
            }
         ]
      },
      {
         "commonName":"Chicory",
         "scientificName":"Cichorium intybus",
         "image":"http://www.ediblewildfood.com/images/chicory-pictures/chicory.jpg",
         "description":"Chicory is a perennial herbaceous plant with a blue or lavender flower. Its leaves are tastiest in the spring and autumn as the summer heat tends to make them taste a little bitter – but they are still edible. Toss them in a salad but before doing so, blanch them. They can be mixed with other greens to minimize their strong flavor. The mature green leaves can be used as a cooked vegetable.",
         "edibleParts":"Edible parts: Leaves and root. Although the flower is edible, it is very bitter.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Cleavers",
         "scientificName":"Galium aparine",
         "image":"http://www.ediblewildfood.com/images/cleavers-pictures/cleavers.jpg",
         "description":"Cleavers are in the Rubiaceae family which consists of flowering plants in the coffee, madder, or bedstraw family. In particular cleavers are in the bedstraw family. There are upwards of 3,000 species in the Rubiaceae family. Other names that cleavers are known as include sticky willy, stickybud, stickyweed, kisses, and clivers. Some people may experience a rash when they touch this plant; if so – DO NOT INGEST!",
         "edibleParts":"Edible parts: Cleavers have historically been known as a medicinal plant although it is food too. The leaves and stems can be used as leaf vegetable although it is very sticky so it will not blend well in a salad. It can be used on bread in sandwiches and sautéed. Fruits of the cleavers can be collected and dried, then roasted for use as a coffee substitute. Leaves and stems can be dried and used for tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Cloudberry",
         "scientificName":"Rubus chamaemorus",
         "image":"http://www.ediblewildfood.com/images/cloudberry-pictures/unripened-cloudberries.jpg",
         "description":"Cloudberries are in the rose family and are a low perennial forb. They are typically known as bakeapples in Newfoundland and Labrador. This berry grows almost exclusively in circumpolar regions and is prized in cultures and cuisines in Scandinavia, Russia, Canada and throughout Alaska. Cloudberry’s berry production varies a lot over the years. Frost during the flowering time can ruin the whole crop and cool weather immobilizes pollinators. Heavy rains and storms can rip the delicate petals in a way that pollinators cannot find the flowers. Bad weather during the growing season shows up the next summer too in the shape of a poor inflorescence.",
         "edibleParts":"Edible parts: The juicy fruit of the cloudberry is edible. Cloudberry is an ingredient in many desserts, jams, confections and alcoholic beverages. Cloudberry is dominantly used in traditional Scandinavian cuisine, although it also appears in Inuit cuisine. Historical documents reveal that cloudberry was utilized by Norwegian sailors and North American Eskimos to prevent and treat scurvy; its roots and leaves were used for medicinal purposes. (Cloudberries have a high vitamin C content.)",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Coltsfoot",
         "scientificName":"Tussilago farfara",
         "image":"http://www.ediblewildfood.com/images/coltsfoot-pictures/coltsfoot-drawing.jpg",
         "description":"Coltsfoot is a perennial plant that looks similar to a dandelion when it blooms in spring. This wild edible plant is unusual in that the flowers bloom and die before the appearance of any leaves, which earned Coltsfoot the name of \"son before the father\" in earlier times. Before the introduction of matches, the felt-like covering of the plant, wrapped in a rag and dipped in a solution of saltpetre, was considered to be excellent tinder after being dried in the sun. This plant contains mucilage, bitter glycosides, and tannins; it is these that are thought to give the herb anti-inflammatory and antitussive (cough prevention and treatment) properties. Coltsfoot root contains pyrrolizidine alkaloids, potentially toxic constituents and it suspected that there may be small quantities in the leaves.",
         "edibleParts":"Edible parts: Coltsfoot flowers can be eaten. They can be tossed into salads to add a wonderful aromatic flavour; or fill a jar with the flowers and add honey to make a remedy to help calm a cough or to sweeten a bitter herbal tea. Dried flowers can be dried and chopped up so that they can be added to pancakes, fritters, etc. Young leaves can be added to soups or stews and small quantities of fresh young leaves can be used in salads. The leaves have a bitter taste unless they are washed after being boiled. An aromatic tea is made from the fresh or dried leaves and flowers. The dried and burnt leaves are used as a salt substitute.",
         "recipes":[
            {
               "recipeName":"Coltsfoot Sorbet",
               "recipeName_url":"http://www.ediblewildfood.com/coltsfoot-sorbet.aspx"
            }
         ]
      },
      {
         "commonName":"Common Sow Thistle",
         "scientificName":"Sonchus oleraceus",
         "image":"http://www.ediblewildfood.com/images/common-sow-thistle-pictures/common-sow-thistle-top.jpg",
         "description":"Common sow thistle is in the Compositae (Asteraceae) family. This is a nutritious plant that contains several minerals (calcium, magnesium, iron, phosphorus, sodium, potassium and zinc) and vitamins ( A, B1, B2, B3, B6, & C). The leaves are also great to use as an antioxidant.",
         "edibleParts":"Edible parts: Earlier in the season this plant tastes nice. Leaves and flowers can be added to salads, cooked like spinach or used in soups, casseroles, etc.. The leaves contain vitamin C, protein, fat, and carbohydrates. Cook stems like asparagus. They taste better if the outer skin is removed. Young roots can be cooked as well.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Common Yarrow",
         "scientificName":"Achillea millefolium",
         "image":"http://www.ediblewildfood.com/images/common-yarrow-pictures/yarrow-flowers-closeup.jpg",
         "description":"Achillea millefolium is known as common yarrow. It is a rhizomatous, spreading, upright to mat-forming perennial that is considered by many to be an aggressive weed. Common yarrow from Europe and Asia was originally introduced to the U.S. during the colonial times, and has since naturalized throughout the U. S. and Canada. Achillea is in reference to Achilles, hero of the Trojan Wars in Greek mythology, who used the plant medicinally to stop bleeding and to heal the wounds of his soldiers.",
         "edibleParts":"Edible parts: Leaves can be consumed raw or cooked. They have a somewhat bitter flavor yet they make a great addition to mixed salads. They are best used when young. Common yarrow leaves are also used as a hop-substitute for flavouring and as a preservative for beer. Although in general yarrow is a very nutritious and beneficial plant to add to the diet, it is recommended that this not be consumes in large quantities. Tea is made from the flowers and leaves.",
         "recipes":[
            {
               "recipeName":"Belgium Wild Beer",
               "recipeName_url":"http://www.ediblewildfood.com/belgium-wild-beer.aspx"
            }
         ]
      },
      {
         "commonName":"Creeping Charlie",
         "scientificName":"Glechoma hederacea",
         "image":"http://www.ediblewildfood.com/images/creeping-charlie-pictures/creeping-charlie.jpg",
         "description":"If you were to search for Creeping Charlie on the Internet you'll quickly discover that there are more websites that offer suggestions to eradicate this plant instead of eating it. This aromatic, perennial, evergreen creeper is in the mint (Lamiaceae) family. Creeping Charlie is an herbaceous plant that spreads by seed and by stolons (creeping stems). Native to Europe, it was brought to North American by the European settlers as medicine and as a ground cover. This minty edible contains a lot of vitamin C and offers a multitude of health benefits. This plant overwinters maintaining its colour under the snow.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw or cooked. The leaves have a mild mint-like flavour and can be tossed into salads to add a slight aromatic tang. Creeping Charlie leaves can also be cooked like spinach, added to soups, stews, or omelettes. Tea is made from the fresh or dried leaves. It is often used mixed with verbena leaves or lovage. This wild edible has been added to beer in much the same way as hops in order to clear it and also to improve its flavour.",
         "recipes":[
            {
               "recipeName":"Belgium Wild Beer",
               "recipeName_url":"http://www.ediblewildfood.com/belgium-wild-beer.aspx"
            }
         ]
      },
      {
         "commonName":"Crimson Clover\nTrifolium incarnatum",
         "scientificName":"Trifolium incarnatum",
         "image":"http://www.ediblewildfood.com/images/crimson-clover-pictures/crimson-plants.jpg",
         "description":"Crimson clover is a species of clover in the family Fabaceae, native to southeastern Europe and southwestern Turkey. It spread to Asia and then to the U.S. by 1819. It has a distinctive, brilliant, crimson cone-shaped head of florets.\nA special thank you to Rita B. Chancy of Tennessee for donating all of these images!",
         "edibleParts":"Edible parts: The seeds and flowers are edible. Seeds can be sprouted and used in salads or sandwiches. They can also be dried and ground into flour. Flower heads can be used fresh or dried as a tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Crowberry",
         "scientificName":"Empetrum nigrum",
         "image":"http://www.ediblewildfood.com/images/crowberry-pictures/Empetrum-nigrum.jpg",
         "description":"Crowberry’s generic name Empetrum, literally means \"growing on rocks\". This evergreen shrub sheds its leaves only once every two to four years and it can grow in very poor soil conditions.People cultivate crowberry as a source of food, as a ground cover and for ornamental purposes. Crowberry is perennial shrub that belongs in the heather family that can survive more than 20 years in the wild.",
         "edibleParts":"Edible parts: The berries are the only edible part although the twigs can be used as tea. They ripen in autumn and remain on the bush throughout the winter. Crowberries can be eaten raw but taste better after they have been exposed to a heavy frost. The taste somewhat acrid and are generally used for making pies, wine, jams, jellies, etc. They are an excellent source of fibre and antioxidants - even better than blueberries. They are high in vitamins C and K. Crowberry is used for smoking fish in some northern cultures.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Daisy Fleabane",
         "scientificName":"Erigeron annuus",
         "image":"http://www.ediblewildfood.com/images/daisy-fleabane-pictures/daisy-fleabane-stem.jpg",
         "description":"Erigeron annuus, whose scientific name accurately indicates it is an annual plant. Erigeron comes from Greek meaning \"early\" and \"old man,\" which allude to the plant's tendency to blossom in late spring and to form fuzzy white seed heads while still producing new flowers. Daisy fleabane, like other fleabane wildflowers, derives its common name from the superstition that dried clusters of these plants could be used to rid a dwelling of fleas. Although it cannot do that, it is however used as a diuretic and medicine for digestive ailments.",
         "edibleParts":"Edible parts: Only the leaves are edible. They are hairy so they have a somewhat ‘furry’ texture making eating them raw not exactly too pleasing. They can be used wherever you cook with greens. Daisy fleabane leaf extracts contain caffeic acid which is an active compound that has antioxidative and neuroprotective effects on neuronal cells.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Dandelion",
         "scientificName":"Taraxacum officinale",
         "image":"http://www.ediblewildfood.com/images/dandelion-pictures/taraxacum-officinale.jpg",
         "description":"Dandelions are often considered a pesky weed in Canada and the U.S. yet European and Asian nations have greatly benefited for years from the incredible nutritional value that this weed contains. Dandelions are a rich source of vitamins, minerals and it even has antioxidants. For example, one cup of raw dandelion greens contains 112% of your daily required intake of vitamin A and 535% of vitamin K. The common yellow dandelion has a long list of powerful healing abilities as well as other health benefits. Contrary to popular belief, the dandelion is a beneficial plant to have. It’s a great companion plant for gardening because it’s long taproot brings up nutrients to the shallow-rooting plants in the garden adding minerals and nitrogen to the soil. Dandelions attract pollinating insects which helps fruits to ripen.",
         "edibleParts":"Edible parts: Leaves, root, and flower. Dandelion leaves can be added to a salad or cooked. They can also be dried and stored for the winter or blanched and frozen. Flowers can be made into juice, or added into many recipes. The root can be made into a coffee substitute. The root and leaves can be dried, stored and made into tea.",
         "recipes":[
            {
               "recipeName":"Wild Pizza",
               "recipeName_url":"http://www.ediblewildfood.com/wild-pizza.aspx"
            }
         ]
      },
      {
         "commonName":"Downy Yellow Violet",
         "scientificName":"Viola pubescens",
         "image":"http://www.ediblewildfood.com/images/downy-yellow-violet-pictures/Downy-Yellow-Violet.jpg",
         "description":"The Downy Yellow Violet is divisible into two varieties which may be distinguished as in the following key.\n1) Plants moderately to thickly hairy, bearing 1-2 flowering stems and 0-2 basal leaves (Viola pubescens var. pubescens)\n2) Plants hairless or almost so, bearing 3 or more flowering stems and 1-3 or more basal leaves (V. pubescens var. scabriuscula)\nThe nectar and pollen of the flowers attract primarily bees and less common insect visitors include small butterflies and skippers.",
         "edibleParts":"Edible parts: Flowers and leaves are edible. The root has been used in the past for medicinal purposes.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Echinacea",
         "scientificName":"Echinacea purpurea",
         "image":"http://www.ediblewildfood.com/images/echinacea-pictures/echinacea.jpg",
         "description":"Echinacea, commonly known as purple coneflower, is an herbaceous perennial plant with four species and six varieties all indigenous to North America. This popular plant has been used in perennial gardens for over 200 years and is widely known. It has also been used historically in North America by indigenous people as a medicinal herb. It’s also used as wild edible food and provides nutrition in addition to many health benefits. Echinacea comes from the Greek word \"echinos\" meaning hedgehog in reference to the spiny center cone.",
         "edibleParts":"Edible parts: Leaves and flower petals are edible. All parts of the plant have been used in tinctures or other medicinal methods.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Elderberry",
         "scientificName":"Sambucus canadensis",
         "image":"http://www.ediblewildfood.com/images/elderberry-pictures/elderberry-bush.JPG",
         "description":"Sometimes propagated as an ornamental shrub, the elderberry bush is a member of the honeysuckle family. It attracts birds and butterflies and can be pruned back every few years to keep it looking good in a landscaped garden. This deciduous shrub produces a fruit that, in recent years has become very popular. The white flowers transform into dark purple fruit late summer. Although the flowers and berries are edible all other parts of this bush are poisonous containing toxic calcium oxalate crystals. Sambucus canadensis is a very close cousin of Sambucus nigra (European Elderberry).",
         "edibleParts":"Edible parts: The berries and flowers are edible. Flowers can be tossed into a salad. Eating the berries raw is not favoured by many. Elderberries tend to end up as pies, in pancakes, jams, jellies, and in wine making.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Evening Primrose",
         "scientificName":"Oenothera biennis",
         "image":"http://www.ediblewildfood.com/images/evening-primrose-pictures/winter-evening-primrose.jpg",
         "description":"The evening primrose is a biennial plant that is perhaps best known for its seeds. Oil is extracted from the seeds and used for a variety of health problems. Native Americans used this plant not just as food but medicine too. It wasn’t until the 1930’s that researchers discovered the oil was powerful. Today it is used to help restore brittle hair and nails to a healthy condition as well as for many health ailments.",
         "edibleParts":"Edible parts: The roots of the first year are fleshy, sweet and somewhat succulent. The roots can grow quite thick and long and resemble parsnips. Young shoots can be eaten raw or cooked (but do not eat a lot of these – sparingly!) The flowers taste great, a little sweet and can be used in salads. Young seedpods can be harvested and steamed or sautéed. It is a very good source of gamma-linolenic acid, an essential fatty acid that is not found in many plant sources.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Eyebright",
         "scientificName":"Euphrasia officinalis",
         "image":"http://www.ediblewildfood.com/images/eyebright-pictures/eyebright-stems.jpg",
         "description":"Eyebright is a native British and European plant that has naturalised in many other areas of the world including Canada and the U.S. Eyebright is a semiparasitic plant meaning that it is nourished by the roots of other plants. This annual plant has been used as a folk medicine to treat eye inflammations and infections, coughs, and poor memory since the Middle Ages. Eyebright is a genus of about 450 species of herbaceous flowering plants in the family Orobanchaceae.",
         "edibleParts":"Edible parts: The stems, leaves and flowers are all edible.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Fern Leaf Yarrow",
         "scientificName":"Achillea filipendulina",
         "image":"http://www.ediblewildfood.com/images/fern-leaf-yarrow-pictures/yarrow.jpg",
         "description":"Yarrow has a good reputation as an anti-inflammatory and antiseptic and is widely used in herbal medicine. This perennial wild edible tastes bitter but after all, bitter is generally better for your health. Yarrow contains many vitamins and minerals, and is used in the treatment of a wide range of disorders. Yarrow is particularly valuable for stopping the flow of blood, treating colds, fevers, treating wounds, kidney diseases, menstrual pain, and much more. It also contains the anti-inflammatory agent azulene, though the content of this varies even between plants in the same habitat. Legend has it that Yarrow was named after Achilles, the Greek mythical figure who used it to stop the bleeding wounds of his soldiers. Ryan Drum, BSc., PhD., has authored over thirty scientific papers and his research discovered that this wild edible was discovered in the Shanidar Cave in Iraq dating back almost 100,000 years.",
         "edibleParts":"Edible parts: Aerial. Although the leaves are bitter, they can be eaten raw or cooked; young leaves mixed in with a salad are recommended. Yarrow leaves are also used as a hop-substitute for flavouring and as a preservative for beer. Although in general yarrow is a very nutritious and beneficial plant to add to the diet, it is recommended not to eat a lot of it on a regular basis. An aromatic tea is made from the flowers and leaves.",
         "recipes":[
            {
               "recipeName":"Yarrow Tea",
               "recipeName_url":"http://www.ediblewildfood.com/yarrow-tea.aspx"
            }
         ]
      },
      {
         "commonName":"Field Pennycress",
         "scientificName":"Thlaspi arvense",
         "image":"http://www.ediblewildfood.com/images/field-pennycress-pictures/field-pennycress.jpg",
         "description":"This is one of the most easily recognized members of the Brassicaceae (mustard) family because of its large and plentiful fruits which have the characteristic cabbage-like flavour when chewed. Like most of the other introduced members of this family, it grows in abundance. Researchers have begun studying the genetics of pennycress in order to improve its potential use as a biofuel crop.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw or cooked. They should be harvested before the plant comes into flower or they will be very bitter. Even the young leaves have a somewhat bitter flavour and aroma, and are not to everyone's taste. They can be added in small quantities to salads and other foods such as in lasagna. They can also be cooked in soups or used as a potherb. For a leaf, it is very rich in protein. The seed is ground into a powder and used as a mustard substitute. The seed can be sprouted and added to salads.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Fireweed",
         "scientificName":"Chamerion angustifolium",
         "image":"http://www.ediblewildfood.com/images/fireweed-pictures/fireweed.jpg",
         "description":"Fireweed is a native plant that’s found throughout the temperate northern hemisphere including some areas in the boreal forests. It earned its name because this plant is the first colonizer in the soil after forest fires. In Great Britain it also earned the name bombweed due to the rapid colonization of land that was bombed during WWII. Fireweed is an important plant for honey producers as it attracts the bees and hummingbirds as well. This beautiful plant is a member of the Evening Primrose family (Onagraceae).",
         "edibleParts":"Edible parts: Young leaves and shoots can be consumed. They can be used in salads, as a vegetable, and young shoots can be used as an asparagus substitute. Older shoots become too tough to ingest.\nThe root can be roasted after scraping off the outside, but often tastes bitter. To mitigate this, the root is collected before the plant flowers and the brown thread in the middle removed. Flower stalks can be consumed raw or cooked and are used when the flowers are in bud. The pith of young or older stems are consumable raw or cooked.",
         "recipes":[
            {
               "recipeName":"Fireweed Syrup",
               "recipeName_url":"http://www.ediblewildfood.com/fireweed-syrup.aspx"
            }
         ]
      },
      {
         "commonName":"Forget Me Not",
         "scientificName":"Myosotis arvensis",
         "image":"http://www.ediblewildfood.com/images/forget-me-not-pictures/forget-me-not-stem.jpg",
         "description":"Forget-me-not is usually an annual or biennial herb with its success being based on its flexibility. The seeds can lay dormant in the soil until they deem it is a suitable time to sprout for up to thirty years and germinate when conditions become favourable. Forget-me-not’s flowers are pollinated by small flies and hymenopterans, and if needs be the plant can also self-pollinate to ensure its seed production. It is in the Boraginaceae (borage) family.",
         "edibleParts":"Edible parts: The flowers are the edible part to this plant. Eat them as a trail snack or use them to decorate cupcakes, toss them in a salad or as a garnish on your dinner plate.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Garlic Mustard",
         "scientificName":"Alliaria petiolata",
         "image":"http://www.ediblewildfood.com/images/garlic-mustard-pictures/garlic-mustard.jpg",
         "description":"Garlic Mustard is a biennial herb that has been labeled an invasive weed in many areas. Originally from Europe, this nutritious plant is found in many locations across North America. The flower of this wild edible only appears from May to June. Garlic Mustard is good for your weight, heart, lowers cholesterol, may help prevent cancer, as well as many other health benefits.",
         "edibleParts":"Edible parts: Flowers, leaves, roots and seeds. Leaves in any season can be eaten but once the weather gets hot, the leaves will taste bitter. Flowers can be chopped and tossed into salads. The roots can be collected in early spring and again in late fall, when no flower stalks are present. Garlic mustard roots taste very spicy somewhat like horseradish. In the fall the seed can be collected and eaten.",
         "recipes":[
            {
               "recipeName":"Wild Pizza",
               "recipeName_url":"http://www.ediblewildfood.com/wild-pizza.aspx"
            }
         ]
      },
      {
         "commonName":"Goldenrod",
         "scientificName":"Solidago",
         "image":"http://www.ediblewildfood.com/images/goldenrod-pictures/goldenrod.jpg",
         "description":"Goldenrod is a perennial plant that is well-known for its healing properties. This wild edible is a plant that reproduces through its roots, bulbs, stems and by its seed. Goldenrod does not cause seasonal allergies as many tend to believe. No one is, no one can be, allergic to Goldenrod pollen. Why? For starters, it has virtually none and it is pollinated by insects. Only wind-pollinated plants such as Ragweed (which blooms at the same time as Goldenrod) can cause allergic reactions.Currently, there are actually 140 varieties of Goldenrod; therefore it has a unique adeptness in crossbreeding with other plants. All varieties of Goldenrod all are equally nutritious and boast many health benefits. Goldenrod can be used fresh or as a dried herb to make tea (although it is bitter), or as a fluid extract, tincture, or in capsules. Nebraska declared a type of Goldenrod (Soldiago gigantea) the state flower in 1895.",
         "edibleParts":"Edible parts: All aerial parts of the plant can be used. The flowers are edible and make attractive garnishes on salads. Flowers and leaves (fresh or dried) are used to make tea. Leaves can be cooked like spinach or added to soups, stews or casseroles. Leaves can be blanched and frozen for later use in soups, stews, or stir fry throughout the winter or spring.",
         "recipes":[
            {
               "recipeName":"Goldenrod Vinegar",
               "recipeName_url":"http://www.ediblewildfood.com/goldenrod-vinegar.aspx"
            }
         ]
      },
      {
         "commonName":"Harebell",
         "scientificName":"Campanula rapunculoides",
         "image":"http://www.ediblewildfood.com/images/harebell-pictures/harebells.jpg",
         "description":"The harebell is a delicate perennial that has a graceful appearance. They have slender stems, sometimes in clusters and some are so weak the plant bends over. Interestingly an old name for this plant in Scotland was Witched Thimble due to old folklore. The genus name, from the Latin campana (bell), means little bell.",
         "edibleParts":"Edible parts: The leaves of this plant are edible and are best used in a salad. Add them to a smoothie, into your homemade dips or anywhere else to add some of its vitamin C.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Henbit",
         "scientificName":"Lamium amplexicaule",
         "image":"http://www.ediblewildfood.com/images/henbit-pictures/henbit_plant.jpg",
         "description":"The common name, Henbit, comes from the observation that chickens like it. Humming birds also enjoy this wild edible for the nectar. Henbit provides valuable erosion control in many cropland fields in the southern U.S. Unlike many of its relatives in the mint family, henbit does not have a strong or distinctive mint scent. Henbit is easily confused with Purple Deadnettle (L. purpureum), which has petioled leaves all the way to the top leaves. The middle and upper leaves of L. amplexicaule (Henbit) do not have petioles. Henbit leaves are also typically smaller than those of Purple Deadnettle. Henbit is an important early season source of nectar and pollen for honeybees.",
         "edibleParts":"Edible parts: Henbit can be consumed fresh or cooked as an edible herb, and it can be used in teas. The stem, flowers, and leaves are edible, and although this is in the mint family, many people say it tastes slightly like raw kale, not like mint. Henbit is very nutritious, high in iron, vitamins and fibre. You can add raw henbit to salads, soups, wraps, or green smoothies. According to Natural Medicinal Herbs (dot net) this plant is anti-rheumatic, diaphoretic, an excitant, febrifuge, a laxative and a stimulant.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Herb Robert",
         "scientificName":"Geranium robertianum",
         "image":"http://www.ediblewildfood.com/images/herb-robert-pictures/herb-robert.jpg",
         "description":"Herb Robert, or what was once known as Saint Robert's Herb, was named after a French monk who lived in 1000 AD, who has cured many people suffering from various diseases using this plant. First Nations people have used this plant internally to help with many health ailments and externally for healing wounds, herpes and skin eruptions. According to an article in The Healing Journal, scientists, herbalists, and botanists have discovered that Herb Robert grows especially abundant in areas that have high radiation levels (which include under hydro lines). It is believed that Herb Robert absorbs the radiation from the soil, breaks it down and disperses it.",
         "edibleParts":"Edible parts: Fresh leaves can be eaten or tossed into a mug to make a tea. The flower and leaves can be dried and stored so that it can be used throughout the winter months as a tea or tossed into salads as a nutrient booster. The root can be dried and used. Rubbing fresh leaves on the skin is said to repel mosquitoes, and the entire plant repels rabbits and deer.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Hop Clover",
         "scientificName":"Trifolium campestre",
         "image":"http://www.ediblewildfood.com/images/hop-clover-pictures/hop-clover.jpg",
         "description":"Introduced from Europe and Asia this annual/biennial weed was used as a means to improve soil conditions and as a forage crop that quickly escaped cultivation. This plant grows well in poor soil because it takes nitrogen from the atmosphere and replaces nitrogen levels in the soil.",
         "edibleParts":"Edible parts: All types of clover have been eaten raw and cooked by First Nations people. Although very little information exists for this type of clover, what is known it that the flowers, leaves and seeds are edible. Flowers can be put into teas. Seeds (in autumn) can be collected and eaten as is or roasted. They can be ground into flour as well. Leaves can be tossed into salads.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Horehound",
         "scientificName":"Marrubium vulgare",
         "image":"http://www.ediblewildfood.com/images/horehound-pictures/horehound.jpg",
         "description":"Horehound is derived from \"Horus\", the Egyptian god of sky and light. For centuries, herbalists have prescribed this edible weed for fevers, malaria and especially for coughs. This is a perennial plant known more for its medicinal purposes than a food source. Although horehound can be consumed, it is highly recommended that this is not done on a regular basis, only once in awhile.\nHorehound as occasional food or as an herbal remedy is not to be taken during pregnancy or while nursing. Higher consumption can cause cardiac arrhythmia or an irregular heartbeat. In larger quantities horehound may also cause diarrhea or an upset stomach.",
         "edibleParts":"Edible parts: Aerial parts are used. Leaves and the flowers can be added into a salad, stir-fry, soup or stew but only once in awhile. This is a plant that is not intended to be consumed as food on a regular basis. This is used more in herbal remedies to help eliminate occasional maladies. It is an immune booster so drinking a cup of horehound tea once a week can be beneficial. It tastes very bitter so adding honey to sweeten is recommended.",
         "recipes":[
            {
               "recipeName":"Horehound Cough Relief",
               "recipeName_url":"http://www.ediblewildfood.com/horehound-cough-relief.aspx"
            }
         ]
      },
      {
         "commonName":"Horsetail",
         "scientificName":"Equisetum arvense",
         "image":"http://www.ediblewildfood.com/images/horsetail-pictures/horsetail.jpg",
         "description":"Horsetail has been used for centuries. Galen (Roman physician and philosopher approx. AD 129-199), used horsetail to aid arthritis, kidney and bladder problems as well as other ailments. This multi-purpose plant has numerous healing properties that include being an anti-hemorrhagic, antiseptic, antibiotic, an astringent, cardiac as well as a diuretic. Makes an excellent healing tea and cooked horsetail can be added to soups, stews or cooked in a stir-fry.",
         "edibleParts":"Edible parts: Aerial (cooked or dried).",
         "recipes":[
            {
               "recipeName":"Herbal Shampoo",
               "recipeName_url":"http://www.ediblewildfood.com/herbal-shampoo.aspx"
            }
         ]
      },
      {
         "commonName":"Horseweed",
         "scientificName":"Conyza canadensis",
         "image":"http://www.ediblewildfood.com/images/horseweed-pictures/Horseweed_stem.jpg",
         "description":"Conyza canadensis (formerly Erigeron canadensis L.) is an annual plant native throughout most of North America and Central America. In traditional North American herbal medicine, horseweed was boiled to make steam for sweat lodges, taken as a snuff to stimulate sneezing during the course of a cold and burned to create a smoke that warded off insects. This plant is a strong competitor for water and is a huge nuisance for farmers.",
         "edibleParts":"Edible parts: Young leaves are edible. The leaves are best dried and stored for later use to help flavour meals (flavour is similar to tarragon). The young seedlings are also edible. Native people once pulverized the young tops and leaves and ate them raw (similar to using an onion). The leaves are a good source of calcium and potassium and well as protein.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Japanese Knotweed",
         "scientificName":"Japanese Knotweed",
         "image":"http://www.ediblewildfood.com/images/japanese-knotweed-pictures/japanese_knotweed_stem.jpg",
         "description":"Japanese knotweed is in the Buckwheat family, and is generally not liked in western nations because it can grow up to one metre per month, its roots travel over three metres deep, and they spread up to 7 metres in every direction. It grows through concrete, asphalt, dams, and buildings. Japanese Knotweed is known as Polygonum cuspidatum in North America, in Europe it is known as Fallopia japonica. It is a very tolerant plant and survives in a wide range of soil types. Its rhizomes can survive temperatures of −35 °C (−31 °F).",
         "edibleParts":"Edible parts: The best edible part of this plant are the young shoots, preferably when they are about 15-20 centimetres tall (6-8”). Depending on your taste buds you may think they have a lemony taste, some say it is more like rhubarb. Young shoots can be consumed raw or cooked and the growing tips and the unfurled leaves on the stalk and branches are edible. Stems can be sliced and steamed, simmered in soups, used in sauces, jams and fruit compotes. Japanese Knotweed is a great source of vitamins A and C. It also provides many vital minerals including iodine and is loaded with resveratrol.",
         "recipes":[
            {
               "recipeName":"Japanese Knotweed Dressing and Dip",
               "recipeName_url":"http://www.ediblewildfood.com/Japanese-knotweed-dressing-and-dip.aspx"
            }
         ]
      },
      {
         "commonName":"Joe Pye Weed",
         "scientificName":"Eupatorium purpureum",
         "image":"http://www.ediblewildfood.com/images/joe-pye-weed-pictures/joe-pye-weed.jpg",
         "description":"Joe Pye weed is an amazing wild edible plant that is an herb, a wildflower, a butterfly plant and looks great in cultivated flower beds. The origin of the common name of this plant is uncertain however the most prevalent theory holds that it refers to a Native American named Joe Pye (Jopi), who used this perennial plant to cure typhus in the 1800’s. This is a hardy perennial that blooms when many other plants are finished and it lasts until the first hard frost. When made into a tea, it has many health benefits. Its other name, gravel root was listed in the U.S. Pharmacopoeia from 1820 to 1842.",
         "edibleParts":"Edible parts: The entire plant can be used including the root. The leaves and stems can be harvested in the summer before the flower buds open and can be dried and stored for later use. The roots are harvested in the autumn. Fresh flowers can be used to make an herbal tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Knapweed",
         "scientificName":"Centaurea nigra",
         "image":"http://www.ediblewildfood.com/images/knapweed-pictures/knapweed-plant.jpg",
         "description":"The common knapweed has the nickname of Hardheads. If you pinch off an old flower head in the autumn, pull off any loose seed heads, there is a very hard kernel. If you then carefully split this there is a good chance that there will be a small grub inside. Goldfinches can often be found feeding on these grubs. This plant can survive for years in both grazed pasture and neglected grassland areas. Flowers are pollinated by a wide range of insects including bees, flies, butterflies and beetles and the seed heads attract goldfinches and other seed feeding birds.",
         "edibleParts":"Edible parts: Only the flowers are edible. This plant has some medicinal purposes.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Knotgrass",
         "scientificName":"Polygonum aviculare",
         "image":"http://www.ediblewildfood.com/images/knotgrass-pictures/knotgrass.jpg",
         "description":"Common knotgrass is a low-growing, weedy grass that is hardy. The stems have nodes and when closely examined, they have attractive flowers. Many people consider this a nuisance weed as it tends to like the side of driveways and through the cracks of patio stones, but the Polygonum aviculare is actually good for recovering from diarrhea. Common Knotgrass is related to buckwheat and dock. This hardy plant is drought resistant as it has a single taproot that can penetrate into the ground up to 45 centimetres.",
         "edibleParts":"Edible parts: Aerial parts are gathered in the summer and can be added to salads, soups, or other dishes. Common knotgrass can also be dried and stored.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Kudzu",
         "scientificName":"Pueraria lobata",
         "image":"http://www.ediblewildfood.com/images/kudzu-pictures/kudzu-petiole.jpg",
         "description":"Kudzu is in the Fabaceae (or Leguminosae) family. It was introduced into the U.S. from Asia in the late 1800’s for erosion control and as a livestock forage; the U.S. government supposedly paid farmers to plant kudzu as a ground cover and as a forage crop. This plant spreads by rhizomes and stolons. Due to its fast growth rate of 30cm (1’) per day it is also called the “mile a minute vine” and “the vine that ate the South” referring to the southern U.S. The bare vines are used for craft projects and basket making.",
         "edibleParts":"Edible parts: Kudzu leaves, flowers, blossoms, vine tips and roots are edible. The kudzu plant produces fragrant blossoms which you can make into jelly, syrup and candy. Cook the root - it contains about 10% starch which can be extracted and used as a coating in deep fried foods, or for thickening soups etc. This plant is a staple food in Japan. Flowers can be tossed on a salad, cooked or pickled. Stems and young leaves can be consumed raw or cooked.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Labrador Tea",
         "scientificName":"Ledum groenlandicum",
         "image":"http://www.ediblewildfood.com/images/Labrador-tea-pictures/labrador-tea-very-close-up-leaf.jpg",
         "description":"Labrador tea is a member of the heath family. This plant is a useful ecological indicator because Labrador tea is characteristic of acidic soils with high moisture and poor nutrient regimes. It is often associated with black spruce. Labrador tea is a slow growing evergreen shrub and new shoots of the season originate at the base of the flower cluster. Interestingly, this shrub can generally survive fire as the rhizomes are found deep in the organic layer and it is often found in areas too wet to burn. It is one of the first plants to re-colonize after fire and grows rapidly.",
         "edibleParts":"Edible parts: The fragrant leaves are used as a soothing tea and they have many medicinal uses. Add lemon to make an iced tea. Leaves were once used in beer making to make it heady. Flowers can also be used to make tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Lamb's Quarters",
         "scientificName":"Chenopodium album",
         "image":"http://www.ediblewildfood.com/images/lambs-quarters-pictures/lambs-quarters.jpg",
         "description":"Lamb's quarters is an annual wild edible that is a member of the Amaranthaceae family; in the genus Chenopodium.It was once thought that lamb's quarters was native to Europe. However, recent archaeological studies show that the seeds were stored and used by the American Blackfoot Indians during the sixteenth century. It is a purifying plant and helps to restore healthy nutrients to poor quality soil.This unique plant tends to spread quickly no matter the soil condition. One lamb’s quarter plant can produce up to 75,000 seeds.",
         "edibleParts":"Edible parts: Leaves, shoots, seeds, flowers. Saponins in the seeds are potentially toxic and should not be consumed in excess. Lamb’s quarters contain some oxalic acid therefore when eating this raw, small quantities are recommended. Cooking removes this acid. Lamb’s quarter can be eaten in salads or added to smoothies and juices. Steaming this edible weed is one method of cooking, or can be added to soups, sautés and much more. Drying this wild edible is one way to add this nutritious plant to your meals throughout the winter or you can blanch and freeze the leaves.",
         "recipes":[
            {
               "recipeName":"Wild Pizza",
               "recipeName_url":"http://www.ediblewildfood.com/wild-pizza.aspx"
            }
         ]
      },
      {
         "commonName":"Mallow",
         "scientificName":"Malva neglecta",
         "image":"http://www.ediblewildfood.com/images/mallow-pictures/mallow_flower_leaf.jpg",
         "description":"The common mallow is part of the large family of Malvaceae plants that include cotton, okra and hibiscus. It is an edible plant that has been used for medicinal care as well as food. The fruits are round and have cheese-like wedges which give the common mallow its nickname, cheese plant. Mallow stems are flexible and come from a central point, often lounging on the ground. This wild edible is used as herbal medicine in a variety of ways. It is an anti-inflammatory, diuretic, demulcent, emollient, laxative and an expectorant.",
         "edibleParts":"Edible parts: All parts of this plant are edible. The leaves can be added to a salad, the fruit can be a substitute for capers and the flowers can be tossed into a salad. When cooked, the leaves create a mucus very similar to okra and can be used as a thickener to soups and stews. The flavour of the leaves is mild. Dried leaves can be used for tea. Mallow roots release a thick mucus when boiled in water. The thick liquid that is created can be beaten to make a meringue-like substitute for egg whites. Common mallow leaves are rich in vitamins A and C as well as calcium, magnesium, potassium, iron and selenium.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Marsh Marigold",
         "scientificName":"Caltha palustris",
         "image":"http://www.ediblewildfood.com/images/marsh-marigold-pictures/marsh-marigold-upper-stem.jpg",
         "description":"IMPORTANT: Do Not Eat Raw!\nMarsh marigold is an herbaceous, rhizomatous perennial that is native in northern temperate regions. It can be found in wet, boggy soils and belongs to the buttercup (Ranunculaceae) family. They are a welcome site in the early dreary days of spring due to their bright yellow colour. The whole plant, especially the older parts contains the toxic glycoside protoanemonin which is destroyed by heat.",
         "edibleParts":"Edible parts: NEVER EAT RAW! Flower buds can be cooked then pickled for use as a caper substitute. Young leaves can be cooked and put into any meal in which greens can be added (i.e. lasagna). Root can be cooked as well.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Mayapple",
         "scientificName":"Podophyllum peltatum",
         "image":"http://www.ediblewildfood.com/images/mayapple-pictures/unripe-mayapple-fruit.jpg",
         "description":"The mayapple is a perennial plant that is in the Berberidaceae (barberry) family. Mayapple is unique in that it has only two umbrella-like leaves and one flower once fully mature. (In its immature stage it has only one leaf and no flower.) Mayapple colonizes by rhizomes forming dense mats making this an easy plant to spot from a distance. Many gardeners have transplanted this to their gardens but it will only survive in moist, humus-rich soils. It is even drought-tolerant within its eastern forest range.",
         "edibleParts":"Edible parts: Only the ripened yellow fruit is edible and the seeds must be removed!. The fruit is tasty but you MUST be sure it is ripe before ingesting it! If it is green or even greenish-yellow do not eat! The fruit can be used in fruit smoothies and in jellies.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Meadowsweet",
         "scientificName":"Spiraea alba",
         "image":"http://www.ediblewildfood.com/images/meadowsweet-pictures/meadowsweet-stem.jpg",
         "description":"Meadowsweet is a perennial plant in the Rosaceae family. Although edible, meadowsweet is more recognized as an herbal medicine used to help with many maladies. In particular the flower head contains salicylic acid. The flowers produce nectar and pollen attracting various bees, wasps, adult long-horned beetles (Cerambycidae), and the moth Ctenucha virginica (Virginia Ctenucha).",
         "edibleParts":"Edible parts: Young leaves are edible but are commonly used in soups and to make tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Milk Thistle",
         "scientificName":"Silybum marianum",
         "image":"http://www.ediblewildfood.com/images/milk-thistle-pictures/thistle_leaves.jpg",
         "description":"For over 2,000 years people around the world have enjoyed milk thistle in their diet. Just about all parts of the plant have been used as food with no reports of toxicity. Although it can be used as food, milk thistle is better known as having medicinal benefits. It is a great tonic, increases appetite and aids in digestion. It is used by many people, including those who were addicted to alcohol to cleanse the liver. Milk thistle is used internally in the treatment of liver and gall bladder diseases, jaundice, cirrhosis, hepatitis and poisoning (including mushroom poisoning).",
         "edibleParts":"Edible parts: The young stalks, leaves, roots and flowers can be eaten. Milk thistle root can be eaten raw or cooked. Leaves can be eaten raw or cooked however the very sharp leaf-spines must be removed first. When cooked these leaves make a great spinach substitute. Flower buds can be cooked. The stems can be eaten raw or cooked. They are best when peeled and soaking is recommended to reduce the bitterness. Milk thistle can be used like asparagus or rhubarb or added to salads. They are at their best when used in spring when they are young. Roasted milk thistle seeds can be used as coffee substitute.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Milkweed",
         "scientificName":"Asclepias syriaca",
         "image":"http://www.ediblewildfood.com/images/milkweed-pictures/young-milkweed.jpg",
         "description":"Milkweed is an herbaceous, tall perennial that got its name for its milky sap that contains latex, alkaloids and other compounds. Carl Linnaeus, Swedish botanist (1707-1778), named the genus after Asclepius, the Greek god of healing because of the many folk-medicinal uses for the milkweed plants. Milkweeds supply tough fibers for making cords and ropes, and for weaving a coarse cloth. It is important to be sure on identifying the milkweed because it has a poisonous look alike, dogbane.",
         "edibleParts":"Edible parts: The flower heads can be fried in batter and eaten. Milkweed flower buds first appear in early summer and can be harvested for about seven weeks. They look like immature heads of broccoli but have roughly the same flavour as the shoots. These flower buds are wonderful in stir-fry, soup, rice casseroles, and many other dishes. Milkweed pods are delicious in stew or just served as a boiled vegetable, perhaps with cheese or mixed with other vegetables but be sure you eat only immature pods. Boiled young shoots, unopened flower buds, flowers, and young pods are said to taste as good as asparagus and other cooked greens. The only way to eat milkweed is as a young shoot (under 15 cm).",
         "recipes":[
            {
               "recipeName":"Stuffed Milkweed Pods",
               "recipeName_url":"http://www.ediblewildfood.com/stuffed-milkweed-pods.aspx"
            }
         ]
      },
      {
         "commonName":"Miner's Lettuce",
         "scientificName":"Claytonia perfoliata",
         "image":"http://www.ediblewildfood.com/images/miners-lettuce-pictures/miners-lettuce.jpg",
         "description":"This sought after wild green is a plant that not only tastes good but contains lots of nutrients. According to a study in the Journal of the American Dietetic Association, 100 grams of miner's lettuce contains a third of your daily requirement of vitamin C, 22 percent of vitamin A, and 10 percent of iron. During the gold rush, miners ate them to prevent scurvy, giving the species its common name. This plant is a native winter annual broadleaf plant in the Montiaceae family.",
         "edibleParts":"Edible parts: Flowers, leaves and roots are edible. Young leaves can be consumed raw or cooked. Older leaves can turn bitter especially in the summer and if the plant is growing in a hot dry location. Flowers can be tossed into a salad. Native Americans harvested the stems,leaves and blossoms and ate them fresh or boiled.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Motherwort",
         "scientificName":"Leonurus cardiaca",
         "image":"http://www.ediblewildfood.com/images/motherwort-pictures/motherwort-young-growth.jpg",
         "description":"Motherwort is a perennial plant that is best known as an herb that helps the heart and women’s disorders. Early Greeks gave pregnant women motherwort who suffered anxiety. The Latin name is derived from the Greek: leon for lion and ouros for tail. The name cardiac comes from kardiaca, meaning heart. Motherwort is categorically a mint that has a very bitter taste.",
         "edibleParts":"Edible parts: Fresh or dried flowers can be used as a flavouring in soups, particularly in split pea or lentil soup. Those who like to make beer have sometimes used the flowers as flavouring. The leaves and flowers can be used to make a tea.",
         "recipes":[
            {
               "recipeName":"Healthy Heart Tea",
               "recipeName_url":"http://www.ediblewildfood.com/healthy-heart-tea.aspx"
            }
         ]
      },
      {
         "commonName":"Mugwort",
         "scientificName":"Artemisia vulgaris",
         "image":"http://www.ediblewildfood.com/images/mugwort-pictures/mugwort-stem.jpg",
         "description":"Mugwort is a member of the Asteracea family and has a very long and interesting history as food and as medicine. Throughout the years mugwort beer has been a favourite in several cultures. Mugwort can be confused with wormwood (Artemisia absinthium). Examination of the leaves is how to tell the difference. Mugwort leaves are green on the top and white underneath, and they have pointed tips and purplish stems. Wormwood leaves have a silvery top and bottom and the flowers are more showy. Mugwort is native to Europe and Asia but has naturalized through much of the world.",
         "edibleParts":"Edible parts: Mugwort leaves can be eaten raw or cooked. They are aromatic and slightly bitter. Young spring shoots can be cooked. Leaves, flowers and roots can be used as a tea. Mugwort was commonly used as a flavouring in beer until hops became popular.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Mullein",
         "scientificName":"Verbascum thapsus",
         "image":"http://www.ediblewildfood.com/images/mullein-pictures/mullein.jpg",
         "description":"Mullein is a soft (almost velvet-like) biennial that can grow very tall. This dicotyledonous plant produces a rosette of leaves in its first year of growth. The second year plant normally produces a single unbranched stem. The tall pole-like stem ends at a dense spike of yellow flowers. It is a common wild edible plant that spreads by prolifically producing seeds, but rarely becomes aggressively invasive, since its seed requires open ground to germinate. The common name, mullein, comes from the German language, meaning king’s candle because of its scepter-like, candle-straight growth. Depending on the summer weather conditions, this wild edible may not produce a lot of flowers. All parts of this plant are covered with star-shaped trichomes. This covering is particularly thick on the leaves, giving them a silvery appearance. As its other name implies, mullein leaves were once used as toilet paper.",
         "edibleParts":"Edible parts: Leaves and flowers. Although the leaves and flowers are edible, enjoying a cup of tea made from these parts is generally preferable. Leaves and flowers can be used in a salad.",
         "recipes":[
            {
               "recipeName":"Mullein Tea",
               "recipeName_url":"http://www.ediblewildfood.com/mullein-tea.aspx"
            }
         ]
      },
      {
         "commonName":"Nepal Dock",
         "scientificName":"Rumex nepalensis",
         "image":"http://www.ediblewildfood.com/images/nepal-dock-pictures/nepal-dock-stem.jpg",
         "description":"Nepal dock is a perennial plant in the Polygonaceae family. Interestingly, this plant regenerates from tap roots and establishes quickly as seedlings. Once established, tough tap roots become difficult to remove. This plant grows abundantly in many parts of Asia and Africa but in particular in India and Nepal. It is used by many for its astringent qualities and for dyeing purposes.",
         "edibleParts":"Edible parts: Young leaves and shoots are edible in small quantities due to very high oxalic acid content. Many people enjoy preparing the leaves and shoots cooked as a vegetable because once cooked, the oxalic acid is greatly reduced. Roots are edible also when cooked.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"New England Aster",
         "scientificName":"Symphyotrichum novae angliae",
         "image":"http://www.ediblewildfood.com/images/new-england-aster-pictures/new-england-aster.jpg",
         "description":"Considered an aggressive weed by some people, the New England aster is prized for its attractive flowers. It is very popular for bees collecting nectar and Monarch butterflies are attracted to the flower of this plant as it provides an important source of late season nectar. Interestingly, the flower of this plant was used in a love medicine by the Iroquois (First Nations). The New England aster blooms from August to October and grows in abundance adding vibrant colour to the autumn landscape. In home gardens it grows best in sunny locations.",
         "edibleParts":"Edible parts: The root has been used for centuries in Chinese medicines. The flower and leaves are also reported to provide health benefits. Flowers can be eaten fresh and added to a salad as can the leaves. When harvesting in September or early October be sure the plant is dry (dew is gone) and cut stem about 10 cm above the ground. Hang upside down in a cool, dark location until totally dried (crumbles easily). Most of the flowers will become white and fluffy but they can still be used. Add dried plant to salads, main dishes or make a cup of tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Oak Leaf Goosefoot",
         "scientificName":"Chenopodium glaucum",
         "image":"http://www.ediblewildfood.com/images/oak-leaf-goosefoot-pictures/oak-leaf-plant.jpg",
         "description":"The species within genus Chenopodium are difficult to distinguish between. They often include several varieties whose identification usually requires the use of a microscope. One of the important distinguishing characters is the texture of the seed-coat. Oak-leaved goosefoot has gained its name from the shape of its leaves which resemble that of many oaks. Oak-leaved goosefoot is an annual that flourishes in nitrogen-rich soil.",
         "edibleParts":"Edible parts: The leaves are edible in small quantities and the seeds can also be consumed but only if they are soaked in water overnight to remove the saponins.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Oxeye Daisy",
         "scientificName":"Leucanthemum vulgare",
         "image":"http://www.ediblewildfood.com/images/oxeye-daisy-pictures/unfurled-flower-head.jpg",
         "description":"The oxeye daisy is a perennial plant in the Compositae family that looks like several flowers in the aster family. It is often confused with the ornamental shasta daisy (edible) which is a taller plant with larger flowers and a toothed whole leaf. The oxeye daisy leaf is quite different from the shasta with deep lobes. There are many white daisies that have been introduced from Eurasia as ornamental and herbal plants; however, the oxeye daisy has larger flower heads.",
         "edibleParts":"Edible parts: The leaves can be eaten raw or cooked. Young spring shoots are finely chopped and added to salads and to soups. Some people find this plant to be somewhat pungent and prefer it cooked. The root can be consumed raw and the flowers can be tossed into a salad or pickled. Young plants are more desirable.",
         "recipes":[
            {
               "recipeName":"Spicy Pickled Daylilies and Daisies",
               "recipeName_url":"http://www.ediblewildfood.com/spicy-pickled-day-lilies-and-daisies.aspx"
            }
         ]
      },
      {
         "commonName":"Palmer's Amaranth",
         "scientificName":"Amaranthus palmeri",
         "image":"http://www.ediblewildfood.com/images/palmers-amaranth-pictures/Palmers-Amaranth-plant.jpg",
         "description":"Palmer's amaranth is native to the southwest U.S. and Mexico, but it has aggressively expanded its range, becoming invasive in many parts of the world. This plant was widely used for food by Native Americans of the Southwest. It is a traditional food of Native Americans including the Navajo, Pima, Yuma and Mohave. Its life-cycle is adapted to desert conditions; it will germinate and grow quickly to produce abundant seed (up to 500,000 seeds per plant) when water is available. Palmer’s Amaranth was named in honour of Edward Palmer (1829–1911), a self-taught British botanist and early American archaeologist.",
         "edibleParts":"Edible parts: Leaves can be used fresh or cooked. They can also be dried for later use in soups or stews and they can be kept in the freezer for later use. Very small seeds were once commonly cooked. They are easy to harvest and they are very nutritious. Seeds ground into a powder, can be used in baking. Whole seeds are gelatinous and difficult to crush in the mouth; they should be ground before use.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Partridgeberry",
         "scientificName":"Mitchella repens",
         "image":"http://www.ediblewildfood.com/images/partridgeberry-pictures/partridgeberry-vine.jpg",
         "description":"There is some confusion on the Internet in which the partridgeberry is known also as the lingonberry. Although both are edible, they are not the same plant despite the close resemblance. A partridgeberry’s ripe fruit forms from the pair of flowers therefore it shows the two markings on each berry, this is unique and distinctive. Partridgeberry is in the Madder family (Rubiaceae). It is distinguished from other woody vines by its small size, pairs of showy white flowers, and long-lasting red berries.",
         "edibleParts":"Edible parts: The leaves and berries are edible. Leaves are typically made into a tea. The berries can be used in any culinary dish although they taste rather bland. High in vitamin C, tannin, anthocyanins and antioxidants these berries have been known to play a huge role in our health including the prevention of certain forms of cancer.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Pearly Everlasting",
         "scientificName":"Anaphalis margaritacea",
         "image":"http://www.ediblewildfood.com/images/pearly-everlasting-pictures/pearly-everlasting.jpg",
         "description":"Pearly everlasting is a perennial native plant (in Canada and the U.S.) that is a member of the Asteraceae family. It is drought tolerant and a favourite food source for many butterflies. Pearly everlasting was often used medicinally by native North American Indian tribes who used it as treatment for a range of ailments. It has been used as a remedy for diarrhea and dysentery. An infusion of the plant is steamed and inhaled in the treatment of headaches.",
         "edibleParts":"Edible parts: Young leaves are edible when cooked.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Peppergrass",
         "scientificName":"Lepidium virginicum",
         "image":"http://www.ediblewildfood.com/images/peppergrass-pictures/peppergrass.jpg",
         "description":"Peppergrass, or Poor Man’s Pepper, is an annual plant that grows from a single taproot. It is in the Brassicaceae (mustard) family and it earned its name for the pepper-like flavour. Interestingly, Pliny the Elder (23 AD – August 25, 79 AD), who was a Roman author, naturalist, and natural philosopher, wrote about pepperweed plant in Naturalis Historia. About one thousand years before that the Incas were cultivating this plant.",
         "edibleParts":"Edible parts: The entire plant is edible. Young leaves can be used as a potherb, sautéed or used fresh in salads. The young seedpods can be used as a substitute black pepper. The leaves contain protein, iron, vitamin A and vitamin C. The flowers can be tossed into a salad and the roots. This entire plant can be put into a food processor along with turmeric, vinegar, miso, garlic and salt to make wild mustard. Collect roots, wash them, crush them and add vinegar and salt you have a horseradish substitute.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Pickerelweed",
         "scientificName":"Pontederia cordata",
         "image":"http://www.ediblewildfood.com/images/pickerelweed-pictures/pickerlweed-leaf.jpg",
         "description":"Pickerelweed is a valuable food source for large variety of aquatic and terrestrial animals. The large leaves and clusters of stems provide an excellent sanctuary for fish, birds, swimming mammals, amphibians and reptiles. Pickerelweed has a dense root system and stems which provide a wave barrier for protecting shoreline sediment from erosion. Pickerelweed received its name from the pickerel fish, with which this plant is thought to coexist.",
         "edibleParts":"Edible parts: Pickerel seeds are tasty when roasted but they can be eaten raw or cooked. They are best collected when they fall into your hand right off the plant. They can be ground and made into flour or toss some seeds into your bread recipe. The young leaves can be eaten as greens; boil older leaves before ingesting. Young stalks are also edible.\nCaution: Be sure that the water source you harvest pickerel from is not polluted.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Pigweed",
         "scientificName":"Amaranthus retroflexus",
         "image":"http://www.ediblewildfood.com/images/pigweed-pictures/pigweed.jpg",
         "description":"Pigweed is an annual great leafy green vegetable that many gardeners love to hate as it tends to show up in gardens uninvited. This wild edible can be a beneficial weed as well as a companion plant serving as a trap for leaf miners and some other pests; also, it tends to shelter ground beetles (which prey upon insect pests) and breaks up hard soil for more delicate neighbouring plants. Because of its valuable nutrition, some farmers grow amaranth today.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw or cooked like spinach, sautéed, etc. Pigweed has a mild flavour and is often mixed with stronger flavoured leaves. Fresh or dried pigweed leaves can be used to make tea. The seed is very small but easy to harvest and very nutritious. The flavour is greatly improved by roasting the seed before grinding it. Pigweed seed can be ground into a powder and used as a cereal substitute, it can also be sprouted and added to salads. The seed is very small but easy to harvest and very nutritious.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Pineapple Weed",
         "scientificName":"Matricaria matricariodes",
         "image":"http://www.ediblewildfood.com/images/pineapple-weed-pictures/pineapple-weed.jpg",
         "description":"Often mistaken for chamomile, pineapple weed is a close sister and is an annual plant. It grows from May to September. Pineapple weed may be confused with young mayweed chamomile; however the mayweed does not emit a pineapple-like odour when crushed. Additionally, mayweed chamomile grows much taller than pineapple weed. This wild edible weed grows in many countries in the northern and southern hemisphere and in some places is nicknamed the \"street weed\".",
         "edibleParts":"Edible parts: Pineapple weed flower s and leaves are a tasty finger food while hiking or toss in salads. Flowers can also be dried out and crushed so that it can be used as flour. As with chamomile, pineapple weed is very good as a tea. Pineapple weed flowers may become bitter by the time the plant blooms, but are still good to eat.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Prickly Pear",
         "scientificName":"Opuntia ficus indica",
         "image":"http://www.ediblewildfood.com/images/prickly-pear-pictures/prickly-pear.jpg",
         "description":"Prickly pear cactus represents fifteen species of the Opuntia genus in the North American deserts. The prickly pear cactus, originated in South America and eventually migrated northward into the valleys of the Andes and then into Mexico and the southern US. In addition to the Texas Prickly Pear there are: Opuntia strigil, Opuntia basilaris, Opuntia rufida, Opuntia phaeacantha, Opuntia engelmannii, Opuntia erinacea, Opuntia humifusa, Opuntia phaecantha, Pancake Prickly Pear, Opuntia chlorotica, Opuntia polycantha, Opuntia violacea, Opuntia violacea, Opuntia spinosbacca, and the Opuntia macrorhiza.",
         "edibleParts":"Edible parts: The fruits and pads are edible. You must be VERY careful when working with a prickly pear. Please refer to Mother Earth News to learn how to properly eat a prickly pear.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Purple Deadnettle",
         "scientificName":"Lamium purpureum",
         "image":"http://www.ediblewildfood.com/images/purple-deadnettle-pictures/purple-deadnettles.jpg",
         "description":"Purple deadnettle’s scientific name Lamium purpureum has the Greek translation ‘the devouring purple monster’. The name is perfect to describe the effect the weed has on its environment. It is an annual winter weed in generally warm areas, which transforms entire plowed farmed lands into reddish purple fields. It has multiple medicinal purposes, and is considered a diuretic, diaphoretic, astringent, purgative, and styptic. The fresh leaves are helpful for external wounds or cuts.",
         "edibleParts":"Edible parts: Only the leaves are edible. In the spring, the young leaf shoots are harvestable and can commonly used within salads. Some people also use it within smoothies. The leaves are also useful as a good tea, which helps treat chills and promote kidney discharge and perspiration.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Purslane",
         "scientificName":"Portulaca oleracea",
         "image":"http://www.ediblewildfood.com/images/purslane-pictures/purslane.jpg",
         "description":"IMPORTANT: a similar plant named \"hairy-stemmed spurge\" is poisonous. Click here for more information.\nPurslane is a succulent annual trailing plant that grows in many countries because it thrives in poor soil. It can be eaten as a cooked vegetable and is great to use in salads, soups, stews or any dish you wish to sprinkle it over. Purslane is antibacterial, antiscorbutic, depurative, diuretic and febrifuge. The leaves are a very rich source of omega-3 fatty acids which prevents heart attacks and strengthens the immune system.",
         "edibleParts":"Edible parts: Leaves, stems and flower buds.",
         "recipes":[
            {
               "recipeName":"Sweet Pickled Purslane Stems",
               "recipeName_url":"http://www.ediblewildfood.com/sweet-pickled-purslane-stems.aspx"
            }
         ]
      },
      {
         "commonName":"Queen Annes Lace",
         "scientificName":"Daucus carota",
         "image":"http://www.ediblewildfood.com/images/queen-annes-lace-pictures/queen-annes-lace.jpg",
         "description":"IMPORTANT: the similar plants listed at the bottom of the page are poisonous.\nQueen Anne’s lace earned its common name from a legend that tells of Queen Anne of England (1665-1714) pricking her finger and a drop of blood landed on white lace she was sewing. Belonging to the carrot family, Queen Anne’s lace is a biennial that is also known as wild carrot. Early Europeans cultivated Queen Anne’s lace, and the Romans ate it as a vegetable. American colonists boiled the taproots, sometimes in wine as a treat. Interestingly, Queen Anne’s lace is high in sugar (second only to the beet among root vegetables) and sometimes it was used among the Irish, Hindus and Jews to sweeten puddings and other foods.",
         "edibleParts":"Edible parts: Using first year Queen Anne’s lace plants are recommended. Roots are long, pale, woody, and are finger-thin and are used in soups, stews and in making tea. First year leaves can be chopped and tossed into a salad. Flower clusters can be ‘french-fried’ or fresh flowers can be tossed into a salad. The aromatic seed is used as a flavoring in stews and soups.",
         "recipes":[
            {
               "recipeName":"Queen Annes Lace Jelly",
               "recipeName_url":"http://www.ediblewildfood.com/queen-annes-lace-jelly.aspx"
            }
         ]
      },
      {
         "commonName":"Red Clover",
         "scientificName":"Trifolium pratense",
         "image":"http://www.ediblewildfood.com/images/red-clover-pictures/red-clover.jpg",
         "description":"Red clover is a wild edible plant belonging to the legume family that is commonly used as food for cattle. This common edible plant has a long and colourful history. Traditional Chinese medicine believed that it was a good tonic for colds, to purify the blood, and at one time they burned it as incense. Native Americans used it as a salve for burns, as well as for bronchial problems. Many cultures have traditionally used red clover to treat whooping cough, respiratory problems, psoriasis, eczema and even cancer. Red clover is one of the herbs in Essiac, and grows in many areas around the world.\nWarning: Not to be taken by women who are pregnant or by nursing mothers.",
         "edibleParts":"Edible parts: Although leaves can be tossed into a salad or used in a tea, the preferable part of this wild edible is the flower. Red clovers are the tastiest of all clovers although it is recommended not to eat too many of these as some people experience bloating.",
         "recipes":[
            {
               "recipeName":"Red Clover Ice Tea",
               "recipeName_url":"http://www.ediblewildfood.com/red-clover-ice-tea.aspx"
            }
         ]
      },
      {
         "commonName":"Red Seeded Dandelion",
         "scientificName":"Taraxacum laevigatum",
         "image":"http://www.ediblewildfood.com/images/red-seeded-dandelion-pictures/Taraxacum-laevigatum-leaf.jpg",
         "description":"Most people would say they can easily identify dandelion but very few are aware that there are two relatively common species, the red-seeded and the common dandelion. While very similar, they can be distinguished by observing two main characteristics, the leaf shape and seed colour. The red seeded dandelion is a perennial plant in the Asteraceae family. Red-seeded dandelion is native to Europe; it was widely introduced to North America.",
         "edibleParts":"Edible parts: The flowers, leaves and roots are edible. Dandelions are bitter, especially after flowering which makes this plant great for digestive issues and is excellent for liver health.Flowers are used as tea, which are beneficial for eye and heart health.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Ribwort",
         "scientificName":"Plantago lanceolata",
         "image":"http://www.ediblewildfood.com/images/ribwort-pictures/ribwort-stem.jpg",
         "description":"Ribwort is a species of flowering plant in the Plantaginaceae (plantain) family. It is also known by several common names such as English plantain, narrow leaf plantain, buckhorn plantain, ribleaf and lamb's tongue. The only weed that ribwort is likely to be confused with is broad-leaved plantain yet there is a very distinct difference in leaf size and shape. This plant is a perennial, reproducing only by seed.",
         "edibleParts":"Edible parts: Ribwort can be eaten raw or cooked. The older the leaves the more bitter they will taste. They do have fibrous veins making it a little bit tricky to eat raw unless chopped. Seeds can be ground into a powder and added to flours in baking.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Rue",
         "scientificName":"Ruta graveolens",
         "image":"http://www.ediblewildfood.com/images/rue-pictures/rue.jpg",
         "description":"Rue is a hardy herb that is drought tolerant. It not only is a great herb to add to meals (in small doses), but it has medicinal values and essential oils that are highly beneficial. The leaves emit a powerful odour, and although safe to consume in small amounts, it tastes very bitter. Chewing on a leaf or two is said to relieve a headache.\nIn large quantities all parts of this plant are not safe to take. Rue should not be used at all by pregnant women as it can induce abortions. The sap contains furanocoumarins which sensitizes the skin to light and can cause blisters or dermatitis in sensitive people.",
         "edibleParts":"Edible parts: In small doses, all aerial parts can be used in soups, sauces, salads, teas and other dishes. It can also be dried and stored for medicinal purposes.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Rugel's Plantain",
         "scientificName":"Plantago rugelii",
         "image":"http://www.ediblewildfood.com/images/rugels-plantain-pictures/rugels-plantain-top-view.jpg",
         "description":"Rugel's plantain is a perennial plant that is native to North America. Like its cousin broadleaf plantain, Rugel's plantain can be a persistent lawn weed and flourishes in compacted soils such as in hiking trails and along sidewalks and driveways. It is frequently referenced in many publications as being Plantago major which is an introduced plant to Canada and the U.S. This plantain is in the Plantaginaceae family. Rugel's plantain was named for German-born pharmacist,doctor and farmer Ferdinand Rugel (1806-1879).",
         "edibleParts":"Edible parts: One of the better flavoured plantains, Rugel's is not as stringy as broadleaf plantain, but it is best if harvested earlier in the season because the leaves become more fibrous with age. Young leaves can be chopped and added to a salad. Older leaves can be baked to make plantain chips.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Scarlet Pimpernel",
         "scientificName":"Anagallis arvensis",
         "image":"http://www.ediblewildfood.com/images/scarlet-pimpernel-pictures/scarlet-pimpernel.jpg",
         "description":"CAUTION: people with sensitive skin can get reactions from touching the plant.\nScarlet pimpernel, commonly known as blue-scarlet pimpernel, red pimpernel, red chickweed, poorman's barometer, poor man's weather-glass, shepherd's weather glass or shepherd's clock, is a low-growing prostrate annual plant. This plant is in the primrose family (Primulaceae). It does not compete well so it favours places where the soil is almost free of other plants. Scarlet pimpernel’s scientific name, ‘adornment of the fields’, is very fitting, and it’s an interesting and not-so-common plant. According to some European herbalists the red-flowered form is especially good for men, while the blue-flowered plants are more suited to women.",
         "edibleParts":"Edible parts: Leaves are edible (although not that great tasting). Do not consume large quantities.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sea Lungwort",
         "scientificName":"Mertensia maritima",
         "image":"http://www.ediblewildfood.com/images/sea-lungwort-pictures/sea-lungwort.jpg",
         "description":"This pleasant tasting plant is in the Boraginaceae family and is primarily found along sandy coastal habitats, such as the upper reaches of beaches, and sand spits. Sea lungwort is a perennial plant with taproots that seems to do well in dynamic, high-stress habitats with shifting substrates. The Latin name, Mertensia, is taken from the name of a German botanist, F. C. Mertens (1764 to 1831). Also known as oysterleaf, this plant is considered endangered in some areas so please check with local conservation authorities before gathering.",
         "edibleParts":"Edible parts: The leaves can be consumed raw or cooked and have a somewhat mild, yet pleasant taste. The thick leaf has a mucilaginous texture. Leaves can be added to salads, and they go quite well with eggs. Flowers are edible and the taproots were once eaten by Inuit.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sea Plantain",
         "scientificName":"Plantago maritima",
         "image":"http://www.ediblewildfood.com/images/sea-plantain-pictures/sea-plantain.jpg",
         "description":"Sea plantain is in the Plantain family (Plantaginaceae) and is well-equipped to stand up to the harsh seaside climates. Its strong taproot extends deep into the ground acting as an anchor. The narrow, slightly wax-like covered leaves group into a tight rosette that can take constant spray from the sea. This species might grow slightly inland from the coast line if the wind carries the salt spray far enough inland. It is not frost tender and is noted for attracting wildlife. This hardy plant can tolerate short periods of time being underwater.",
         "edibleParts":"Edible parts: The leaves and seeds are edible. Young leaves can be consumed raw or cooked although fresh is best and has a pleasant taste. This is one of the nicer-tasting and more palatable (when fresh) members of the genus. Seeds can be eaten raw or cooked; and they can be ground into flour although they are tedious to harvest.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sea Sandwort",
         "scientificName":"Honckenya peploides",
         "image":"http://www.ediblewildfood.com/images/sea-sandwort-pictures/seaside-sandwort-flowers.jpg",
         "description":"Sea sandwort is a succulent perennial edible plant with creeping stolons that make it well adapted to growing in mobile substrates. It is a subdioecious plant; which means that some flowers produce seeds but no pollen, while others produce mostly pollen but also a few seeds. This plant was named after German botanist Gerhard August Honckeny (1724–1805). Sea sandwort stabilizes and fertilizes the substrate it grows on, thereby helping other maritime plants. Over time it changes the conditions in a way that they meet the other plants’ demands and eventually finds itself in retreat from the increasing competition. It is in the Caryophyllaceae family.",
         "edibleParts":"Edible parts: Young shoots raw or cooked are edible. They have high levels of vitamins A and C. They are maximum for nutrition before they flower although still edible after blooming. In Iceland the plant is steeped in sour whey and fermented. Seeds can be used in baking or as a garnish although they are so tiny they are very difficult to harvest.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Self Heal",
         "scientificName":"Prunella vulgaris",
         "image":"http://www.ediblewildfood.com/images/self-heal-pictures/self-heal.jpg",
         "description":"Self-heal is a useful tenacious plant that loves lawns. It tends to stay low to the ground to avoid mowing. It attracts bees and butterflies when flowering and is edible. Self-heal, as the name suggests was once a sought-after medicinal herb by herbalists and country folk alike. It was once used to cure a variety of health ailments.",
         "edibleParts":"Edible parts: Self-heal is edible and medicinal. The leaves and flowers contain high levels of antioxidants (which prevent cancer and heart disease). It has been used for centuries as medicine. Raw self-heal leaves are edible, suitable as a pot herb and have a subtle bitter taste. Although they taste better cooked, a lot of the nutrients are lost (as they are in vegetables as well) in this process. Toss leaves onto a salad, in a soup or stew or once you have mashed potatoes, add them to this. A cold water infusion of freshly chopped (or dried) leaves makes a nourishing drink. (Boil water to make tea as well.) This is a plant that can help many health ailments.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sheep Sorrel",
         "scientificName":"Rumex acetosella",
         "image":"http://www.ediblewildfood.com/images/sheep-sorrel-pictures/sheep-sorrel_stem.jpg",
         "description":"Sheep sorrel is a perennial plant that is in the buckwheat family. It reproduces by seed and by spreading horizontal roots. It is well recognized within the alternative cancer treatment community as one of the ingredients in Essiac tea.",
         "edibleParts":"Edible parts: The leaves have a lemony, tangy or nicely tart flavour. Leaves (in small quantities) can be eaten raw or cooked; used as thickeners in soups, dried and ground into a powder to use a flour or make into noodles. Seeds can be eaten raw or cooked.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Shepherds Purse",
         "scientificName":"Capsella bursa pastoris",
         "image":"http://www.ediblewildfood.com/images/shepherds-purse-pictures/shepherds_purse-flower-2.jpg",
         "description":"Shepherd's purse is one of the earliest wild greens to appear in the spring. Before the flower stalks appear, the leaves are especially good in salads or cooked as greens. When the plant flowers, the larger basal leaves tend to die off, leaving only the smaller leaves clasping the stem. Although still edible, they tend to get tough, develop more flavour and become labor-intensive to collect.",
         "edibleParts":"Edible parts: Shepherds purse leaves can be eaten raw or cooked (raw is healthier). Young leaves used before the plant flowers is a tasty addition to salads. The leaves are a cress and cabbage substitute that becomes peppery with age. The leaves are generally available all year round and can be dried for later use. The flowering shoots can be eaten as well. Shepherd’s purse seeds can be used in a salad, but they are so tiny and fiddly you’ll need patience to collect them. The root is also edible; dried and ground up is can be used as a ginger substitute.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Silverweed",
         "scientificName":"Potentilla anserina",
         "image":"http://www.ediblewildfood.com/images/silverweed-pictures/silverweed.jpg",
         "description":"Silverweed is a perennial plant that is edible and has a multitude of health benefits. This plant is a member of the rose family and grows in many countries. There were changes to botanical names therefore silverweed can be properly identified by either of its Latin names (Potentilla or Argentina anserina). Interestingly, when a person has excessively sweaty feet, placing a leaf or two in each shoe is a natural way to help absorb moisture (due to the starch content). Silverweed is an analgesic, anti-spasmodic, astringent, diuretic and a tonic.",
         "edibleParts":"Edible parts: All parts of the silverweed are edible and are a good source of flavonoids. Leaves can be made into an herbal tea or tossed into a salad, stew or a stir fry. The roots (best collected in autumn) can be used raw or cooked. Some people have dried the root and powdered it to use in a variety of culinary dishes as it is a natural use for added starch. It is said to have a pleasant nutty taste.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sow Thistle",
         "scientificName":"Sonchus arvensis",
         "image":"http://www.ediblewildfood.com/images/sow-thistle-pictures/sow-thistle.jpg",
         "description":"The perennial sow thistle (Sonchus arvensis) is often confused with the annual sow thistle (Sonchus oleraceus). The main difference between the two is that the annual sow thistle has much smaller flowers (less than 2.5 cm across) than the perennial sow thistle. Perennial sow thistle flowers are larger and resemble the dandelion. Both plants are edible. Annual sow thistle tends to be less prickly.",
         "edibleParts":"Edible parts: The leaves, flowers and roots are edible. These are best consumed when the plant is young because the older it gets the more bitter it becomes. Once it becomes bitter you can cook with it or mix it with pleasant tasting greens. Leaf spines need to be removed. The leaves are rich in mineral salts and vitamin C. Harvesting the root while young is preferred and can be roasted and grounded to use like coffee.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Spiderwort",
         "scientificName":"Tradescantia virginiana",
         "image":"http://www.ediblewildfood.com/images/spiderwort-pictures/spiderwort-leaves-flowers.jpg",
         "description":"Spiderwort is a common wild plant that is also cultivated in gardens in many countries. There are approximately 70 species of this perennial plant with the Virginia spiderwort being one of the most common. Virginia spiderwort is native in most eastern areas of Canada and the U.S. It was introduced to Europe in the 1600’s as a plant to cultivate in gardens. For those living in the central area of North America it is important to be sure you are foraging Virginia spiderwort; the Western spiderwort (Tradescantia occidentalis) is a threatened plant in Manitoba, Saskatchewan, Alberta and 19 American states.",
         "edibleParts":"Edible parts: Spiderwort had many uses in First Nation’s culture as food and medicine. The seed are edible when roasted and is ground into a powder (although they are somewhat bitter to taste). Leaves can be made into a tea or tossed into salads, soups, etc. The root can be collected all year round. The flowers can be tossed on top of a salad and eaten. (Dried, powdered flowers were once used as a snuff for nosebleeds.)\nExternally, this plant can be used as a poultice to help heal wounds and hemorrhoids. Internally the leaves and roots are a valuable alternative medicine used by medical herbalists for their patients as an antidiarrheal, analgesic, anthelmintic, antiperiodic, astringent, diaphoretic, emetic, emmenagogue, expectorant, sedative, tonic, vermifuge, and vulnerary. Also, drinking spiderwort tea is supposed to be a good for increasing breast milk (Galactagogue).",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Spotted Dead Nettle",
         "scientificName":"Lamium maculatum",
         "image":"http://www.ediblewildfood.com/images/spotted-dead-nettle-pictures/spotted-dead-nettle.jpg",
         "description":"Spotted dead nettle is considered a culinary herb. Unlike nettles, it does not sting nor irritate the skin (hence the reason for the name dead) and it is generally more recognized as a groundcover in gardens than a wild edible. It comes up strong in the spring and somewhat hibernates during the summer heat, but often rejuvenates in the coolness of autumn. This plant is a perennial that is considered a semi-evergreen.",
         "edibleParts":"Edible parts: Leaves and flowers can be used. They can be used to make an herbal tea. Add leaves and flowers into a salad, stews or soups. Chopped up finely, they can be added to mashed potatoes.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Spring Beauty",
         "scientificName":"Claytonia caroliniana",
         "image":"http://www.ediblewildfood.com/images/spring-beauty-pictures/spring-beauty-plant.jpg",
         "description":"Spring beauty grows from a starchy rhizome, where it stores all the energy it made the previous season to fuel its early spring growth. The pink veins and yellow circle on the flower petals act as nectar guides for pollinators. Because those pollinators are generally out and about when the sun is shining, spring beauty only opens on sunny days. Some Native elders used this plant behavior as a barometer to predict oncoming storms.",
         "edibleParts":"Edible parts: The root can be consumed raw or cooked like potatoes. They are rich in starch; it has a pleasant nutty flavour. Leaves and stems can be eaten raw or cooked; they have a mild flavour.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"St John's Wort",
         "scientificName":"Hypericum perforatum",
         "image":"http://www.ediblewildfood.com/images/st-johns-wort-pictures/st-johns-wort.jpg",
         "description":"St. John’s wort is an herbaceous perennial growing in many areas around the world and has a long history of herbal use. It fell out of favour in the nineteenth century but recent research has brought it back to prominence as an extremely valuable remedy for nervous problems. In clinical trials about 67% of patients with mild to moderate depression improved when taking this plant. The flowers and leaves are analgesic, antiseptic, antispasmodic, aromatic, astringent, cholagogue, digestive, diuretic, expectorant, nervine, resolvent, sedative, stimulant and vulnerary. This cheery yellow-flowered plant is used in treating a wide range of disorders. The common name comes from its traditional flowering and harvesting on St John's day, 24th of June.",
         "edibleParts":"Edible parts: The aerial plant is dried for a variety of uses. Fresh flowers are used in making healing oils and they can be tossed into salads. Fresh leaves can be used in salads.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Stinging Nettle",
         "scientificName":"Urtica dioica",
         "image":"http://www.ediblewildfood.com/images/stinging-nettle-pictures/stinging-nettle.jpg",
         "description":"Stinging nettle is a large, rhizomatous perennial wild edible plant that can grow quite tall. Originally from Europe and Asia, this plant has sharp hairs that break easily and can irritate or sting when the plant is touched; however it is a vitamin-rich food source as well as a remedy for various medical conditions. Stinging nettle has been used for hundreds of years to treat painful muscles and joints, eczema, arthritis, gout, and anemia. Fibrous stems of mature plants can be used to make twine, fishing nets, snares and other items. Nettles were traditionally dried and fed to livestock throughout winter. In Europe the plants are harvested commercially for extraction of the chlorophyll, which is used as a safe green colouring agent (E140) in foods. There are between 30 and 45 species of flowering plants of the genus Urtica in the family Urticaceae.",
         "edibleParts":"Edible parts: Leaves, stems and roots. Young leaves are preferable however, no matter how far into the growing season be sure to remember that until dried or cooked, stinging nettle leaves will have those stinging hairs – never eat them raw! Nettles make an excellent spinach substitute and can also be added to soups and stews. Nettle beer is brewed from the young shoots. Nettle root is used for medicinal purposes including enlarged prostate and when there is difficulty in urination due to BPH. Nettle tea made from the root can help urinary ailments. Tea made from the leaves is rich in iron and can aid coagulation and the formation of hemoglobin.",
         "recipes":[
            {
               "recipeName":"Stinging Nettle Soup",
               "recipeName_url":"http://www.ediblewildfood.com/stinging-nettle-soup.aspx"
            }
         ]
      },
      {
         "commonName":"Strawberry Blite",
         "scientificName":"Chenopodium capitatum",
         "image":"http://www.ediblewildfood.com/images/strawberry-blite-pictures/strawberry-spinach-plants.jpg",
         "description":"Strawberry Blite is also known as blite goosefoot, strawberry goosefoot, beetroot, strawberry spinach, Indian paint, and Indian ink. It is native to most of North America. It is considered a weedy species, popping up in disturbed soils mostly unexpectedly. Many people grow this as an ornamental. Many websites claim this is an annual plant whereas it is a monocarpic. A monocarpic plant lives to produce a single crop of seeds then it dies. A monocarp is not necessarily short-lived. This is in the lamb's quarters (Chenopodium) family.",
         "edibleParts":"Edible parts: Leaves can be consumed raw or cooked; young leaves are best and always in moderation. They can be used like spinach and are a good source of vitamins C and A. The somewhat sweet fruit can be eaten raw or cooked. A red food colouring can be obtained from the fruit. Seeds are small and fiddly, but can be consumed. They should be soaked in water overnight and thoroughly rinsed before they are used in order to remove any saponins.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sunflower",
         "scientificName":"Helianthus annuus",
         "image":"http://www.ediblewildfood.com/images/sunflower-pictures/sunflower.jpg",
         "description":"The wild sunflower is the non-cultivated cousin of the sunflower and it has showy ray petals which attract birds and butterflies. Interestingly, the leaves are phototropic; they turn to follow the sun therefore increasing the amount of light and leads to increased photosynthesis. This adaptation occurred because the sunflower’s primary source of nutrition is from conducting photosynthesis. The wild sunflower is considered a noxious weed in many areas across Canada and in several U.S. states. Wild sunflowers are native to North America and were naturalized in Europe in the XVI century.",
         "edibleParts":"Edible parts: The seeds are the typical edible sunflower seeds, but the wild sunflower seeds are very small, unlike the cultivated varieties used for commercial seed production. They can be consumed raw or cooked. (Seeds ripen from Sep to October.) Rich in fats, the seed can be ground into a powder and mixed with cereal flours to make nutritious bread. Seeds can be used for spouting and eaten as soon as they sprout. Young flower buds can be steamed and served like globe artichokes. The leaf petioles can be boiled and mixed in with other vegetables. Flower petals, leaves and roots can be used to make tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Supplejack Vine",
         "scientificName":"Ripogonum scandens",
         "image":"http://www.ediblewildfood.com/images/supplejack-vine-pictures/supplejack-vines.jpg",
         "description":"Supplejack vine is in the botanical family of Ripogonaceae, a family found only in New Zealand, eastern Australia and New Guinea. It is a hardy, evergreen climber. Early Maori used the tough stems of the Supplejack vine to tie the thatches roofs and walls of their homes. These were used to tie up fencing and platforms as well. Both the Maori and European settlers used this hardy vine to make crayfish pots, eel traps, ladders, flooring platforms in canoes, and baskets. As well as being used in construction, this vine is a great source of food and has been used as medicine. Various parts of the vine have been used for bowel troubles, rheumatism, fever, and as a blood tonic.",
         "edibleParts":"Edible parts: The berries are edible once they are ripe and can be eaten raw or cooked. Very young shoots are palatable and supposedly resemble asparagus in taste; it is best to eat these cooked. The seeds can be consumed and contain fatty acids. The sap can be consumed as well. The roots are known to be a substitute for sarsaparilla and they are rich in starch. Leaves are also edible.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sweet Rocket",
         "scientificName":"Hesperis matronalis",
         "image":"http://www.ediblewildfood.com/images/sweet-rocket-pictures/sweet-rocket.jpg",
         "description":"Sweet rocket is an upright, multi-branched, perennial or biennial. It has white, lavender or purple, flowers that are very fragrant, particularly in the evening. (Hesperis comes from the Greek word for evening.) Native to Europe and Asia, this plant has naturalized in many areas of eastern North America and appears in some western areas of Canada and the U.S.",
         "edibleParts":"Edible parts: Young leaves can be tossed into salads and other dishes. They do have a bitter flavour although it adds an extra tang to salads. For culinary purposes, the leaves should be picked before the plant flowers. The seed can be sprouted and added to salads. The seed contains 50 percent of edible oil. Flowers can be tossed into salads.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sweet White Clover",
         "scientificName":"Melilotus albus",
         "image":"http://www.ediblewildfood.com/images/sweet-white-clover-pictures/sweet-white-clover.jpg",
         "description":"Sweet white clover is considered invasive in many areas. It's gangly appearance is easy to spot but often the aromatic scent is what gives it away. Interestingly, one plant can produce from 14,000 to 350,000 seeds. Most of the seeds remain viable in the soil for 14 to 20 years, and some seeds have remained viable for more than 80 years. It is typically a biennial plant and sometimes an annual or short-lived perennial. It is native to Europe and Asia. The first known record of this plant in North America is from 1664 in Boucherville, Quebec. It was introduced as a forage crop and honey plant. It is a member of the Fabaceae family.",
         "edibleParts":"Edible parts: Young leaves can be eaten raw or cooked preferably before the plant blossoms. They are bitter and aromatic, usually used as flavoring in salads. Young shoots can be cooked and used like asparagus. The flowers, raw or cooked, are edible. The whole plant thoroughly dried can be used to make a tea with a hint of vanilla. The seeds can be used as a spice. Consuming this plant occassionally or used as a spice is highly recommended. There is some research that indicates that regular consumption might have detrimental effects on the liver. It can causes bloating in some people as well.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Sweetfern",
         "scientificName":"Comptonia peregrina",
         "image":"http://www.ediblewildfood.com/images/sweetfern-pictures/sweetfern.jpg",
         "description":"Sweetfern is a native shrub to eastern Canada and eastern U.S. It is in the bayberry family (Myricaceae) and tends to occur in colonies. This is not a true fern despite its name. Sweetfern has medicinal properties and has been known to assist every organ in the elimination of toxins. It helps to clear lymph, blood and skin. A cold water infusion has been used externally by some people claiming that this helps to counter the effects of poison ivy.",
         "edibleParts":"Edible parts: The nutlets are edible. Tea can be made from the leaves. Dried and powdered leaves can be used as a spice.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Tea Plant",
         "scientificName":"Camellia sinensis",
         "image":"http://www.ediblewildfood.com/images/tea-plant-pictures/tea-plant-leaves.jpg",
         "description":"Tea is the most widely consumed beverage in the world taking only second place to water. Over three million tonnes are grown annually for tea consumers worldwide. The tea plant is an evergreen shrub that provides us with black, white, yellow, and green tea as well as oolong and pu-erh tea. It is the leaves and leaf buds that are commonly used to produce the teas we enjoy. The difference in taste is how they are processed and how long the leaves are left on the shrub before harvesting. Interestingly, in Tanzania, tea plants have been noted to escape from cultivation in areas of Amani and around Mount Kilimanjaro and are considered to be invasive in parts of the Usambara mountains. The tea plant can live anywhere between 30 and 50 years.",
         "edibleParts":"Edible parts: Tea leaves can be eaten and in some cases they are recommended to be eaten as opposed to making tea because the nutrient content is much higher when consumed as food. The flowers are edible as well. A clear golden-yellow edible oil resembling sasanqua oil is obtained from the seed (must be refined before ingested).",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Teasel",
         "scientificName":"Dipsacus fullonum",
         "image":"http://www.ediblewildfood.com/images/teasel-pictures/winter-teasel-seed-heads.jpg",
         "description":"Teasel is a biennial plant that is very distinct to identify. The first year plant only produces a rosette of leaves. The second year it can grow to almost 2.5 metres and has a unique flower head. This plant was originally brought to North America from Europe. Interestingly, an average teasel plant produces 3300 seeds that birds enjoy. Teasel is self-fertile and it is noted for attracting wildlife.",
         "edibleParts":"Edible parts: Young leaves are edible although one must take great care to avoid the spiny, stout hairs. Teasel leaves can be consumed raw, cooked or added to a smoothie. The root can be used in a tea or for making vinegar or tinctures. The root has many health benefits as it contains inulin and a scabiocide.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Thimbleberry",
         "scientificName":"Rubus parviflorus",
         "image":"http://www.ediblewildfood.com/images/thimbleberry-pictures/thimbleberry-leaves.jpg",
         "description":"Thimbleberry is in the Rosaceae (Rose) family and is in the same genus (Rubus) as raspberry, blackberry, loganberry, boysenberry, tayberry, dewberry and many others. Rubus fruit are an aggregate fruit composed of small, individual drupes, each individual is termed a drupelet. In a sense they are many little berries grouped together to make one large berry. This bush has broad soft leaves that can be used to make a quick pouch for holding berries you have gathered and provide a practical solution to assist you during your bathroom duties.",
         "edibleParts":"Edible parts: Thimbleberry fruits are smaller, flatter, and softer than raspberries, and have many small seeds. Like many of the other Pacific Northwest berries, thimbleberry was commonly eaten by the Native Americans. Thimbleberry is a great source of vitamins A and C with traces of potassium, calcium and iron.This berry helps to boost the immune system.The young shoots, roots and leaves have been used to treat many ailments. A tea is made of the leaves or roots as a blood tonic in the treatment of nausea, vomiting, diarrhea and dysentery. Its effects are believed to tone and strengthen the stomach helping increase appetite. Both the leaves and the bark of these plants have astringent properties.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Toothwort",
         "scientificName":"Dentaria diphylla",
         "image":"http://www.ediblewildfood.com/images/toothwort-pictures/toothwort-plant.jpg",
         "description":"Toothwort is a perennial plant that thrives is moist soils preferably in wooded areas. It is in the Brassicaceae family (mustard). This is a plant that is native to North America and is in the same family as the Cutleaf Toothwort (Cardamine concatenate).",
         "edibleParts":"Edible parts: The leaves and roots of the toothwort are edible. They can be eaten raw or cooked. Leaves can be added to salads or tossed into soups. The root can also be eaten raw or cooked. It has a crisp texture and a pleasant (somewhat) pungent taste. It can be added to salads or used as a relish. The root has a pungent acrid taste when first harvested; many Natives cleaned the roots, placed them on a blanket and covered them; then they left them to ferment for 4 - 5 days. Apparently after doing this, the roots developed a sweet taste. Fresh roots have a crisp texture that tastes somewhat hot and peppery and can be used to make horseradish.",
         "recipes":[
            {
               "recipeName":"Wild Toothwort Dip",
               "recipeName_url":"http://www.ediblewildfood.com/wild-toothwort-dip.aspx"
            }
         ]
      },
      {
         "commonName":"Trout Lily",
         "scientificName":"Erythronium americanum",
         "image":"http://www.ediblewildfood.com/images/trout-lily-pictures/trout-lily.jpg",
         "description":"Trout Lily grows in huge colonies that can completely cover a forest floor. The colonies can be hundreds of years old and takes a long time to grow to such a size. Its bulbs are sterile up to about the seventh year and then it produces only one leaf and no flowers. When they mature one plant will grow two leaves and one, beautiful yellow flower. The colony spreads mostly by runners and less importantly by seed. Trout lilies have a symbiotic relationship with ants known as myrmecochory. This means that they exchange a lipid-rich appendage on their seeds in return for an ant seed dispersal that spreads the colony and protects the seeds from predation. This plant is a beautiful spring ephemeral meaning it is short-lived in the spring only.",
         "edibleParts":"Edible parts: Trout Lily is both medicinal and edible. The leaves have a very mild flavour and the flowers have a slight sweetness due to their nectar and are also slightly acrid. The corms are edible as well and have a cucumber-like taste. Trout lilies are an emetic (makes you throw up), therefore it is recommended not to eat mass quantities of these in one day. You can add this plant to a salad or eat them as a trail snack. You can also make a tea with the flower, leaves or corm (or all). Collect enough corms then they can be roasted.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Valerian",
         "scientificName":"Valeriana officinalis",
         "image":"http://www.ediblewildfood.com/images/valerian-pictures/valerian-stem.jpg",
         "description":"Valerian is most recognized for helping to ease insomnia, anxiety, and nervous restlessness. It became popular in Europe in the 17th century. In addition to being medicinal this is also edible. This plant was in the Valerianaceae family but is now in the Caprifoliacaeae family. When dried, this plant smells horrible.",
         "edibleParts":"Edible parts: The seeds are edible and the leaves have been used in the past as a condiment. Leaves can be used to make a tea as well as the root. Be sure to use in moderation.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Vervain Mallow",
         "scientificName":"Malva alcea",
         "image":"http://www.ediblewildfood.com/images/vervain-mallow-pictures/vervain-mallow-stem.jpg",
         "description":"Vervain mallow was once known only as a cultivated plant but has escaped gardens and nowgrows in the wild. The stem of this plant contains a fibre that can be used to make cordage. Yellow, green and cream-coloured dyes can be obtained from this plant and the seed heads. The vervain mallow prefers sunlight and it prefers moist soil that ranges from a balanced pH to alkaline. Vervain mallow is a European native.",
         "edibleParts":"Edible parts: The flowers, leaves, and seed are edible. The flowers can be tossed into a salad. Leaves can be eaten raw or cooked. Hollyhock mallow leaves are fairly bland and can be used as a green in a salad. The seeds are rather tasty, somewhat nutty but are laborious to collect as they are quite small.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"White Trillium",
         "scientificName":"Trillium grandiflorum",
         "image":"http://www.ediblewildfood.com/images/white-trillium-pictures/trillium-stamens.jpg",
         "description":"White trillium is the showiest of all trilliums worldwide and is highly prized in Europe and Japan. In springtime many forest floors are totally covered in trilliums. Most botanists believe that the trillium belongs to a separate family of plants called Trilliaceae. Its close relatives are the genus Paris and Trillidium, neither of which is native to North America. Trilliums are slow growers requiring minimum seven years from seed to flowering. Once a seed germinates, the first year’s focus is on the roots only. In its second year, the seedling will produce a single seed leaf. In the third year, the first true leaf will appear. Two or more additional years will be required before the plant produces the three-whorled leaves that we are familiar with.",
         "edibleParts":"Edible parts: The leaves can be cooked and consumed. Due to the (approximate) seven year life cycle it is best to harvest only only leaf per plant. Check with your local laws as this plant may be protected. In the province of Ontario, trilliums are not to be picked if on conservation lands or in provincial parks. If the leaves as well as the flower are picked, the plant could die as it no longer has the ability to produce the energy it needs to take it through the winter into another spring.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Wild Bee Balm",
         "scientificName":"Monarda fistulosa",
         "image":"http://www.ediblewildfood.com/images/wild-bee-balm-pictures/wild-bee-balm.jpg",
         "description":"Wild bergamot is very attractive to bees, butterflies and some birds. This aromatic plant is a perennial that grows from creeping rhizomes. This plant was extensively used by many Native Americans including, (but not limited to) the Menominee, the Ojibwa, and the Winnebago. It was used most commonly to cure colds by being made into a tea. Monarda didyma (red bee balm) is also known as Oswego tea, not Monarda fistulosa (wild bee balm).",
         "edibleParts":"Edible parts: Leaves and flowers. The leaves of wild bee balm are edible raw or cooked. They are also used as a flavoring in salads and cooked foods. The flowers make an attractive edible garnish in salads. Fresh or dried flowers and (or) leaves can be brewed into an aromatic tea.",
         "recipes":[
            {

            }
         ]
      },
      {
         "commonName":"Wild Grape Vine",
         "scientificName":"Vitis riparia",
         "image":"http://www.ediblewildfood.com/images/wild-grape-vine-pictures/wild-grapes.jpg",
         "description":"IMPORTANT: A similar plant named Menispermum canadense (common moonseed) is poisonous. Click here for more. (Grape vine leaves taste like grapes.)\nThe wild grape vine is truly a vining plant; this means it has no solid, upright trunk. This climbing, multi-stemmed vine can grow so well it can totally envelop bushes and trees. Although the wild grape vine is also known as the riverbank grape, it grows well in locations other than riverbanks. There are dozens of species of wild grapes found growing throughout the world. All are perennial, woody vines that are deciduous. Grape vines grow thicker and higher than most other native vines.",
         "edibleParts":"Edible parts: The ripe grape can be eaten but tastes better after the first frost. They are not that large so eating them as a trail snack is suggested. Making juice from these is a great way to benefit from their goodness and the grapes freeze well so they can be used for juice throughout the winter. The leaves are also edible. They can be eaten in a salad (they have a tangy citrusy taste) or cooked. Throughout the Mediterranean, grape leaves are stuffed with rice, meat and spices. These are known as Dolma and there is also Warak Enab. The leaves can be blanched and frozen for use throughout the winter months.",
         "recipes":[
            {
               "recipeName":"Grape Leaf Burritos",
               "recipeName_url":"http://www.ediblewildfood.com/grape-leaf-burritos.aspx"
            }
         ]
      },
      {
         "commonName":"Wild Violet",
         "scientificName":"Viola odorata",
         "image":"http://www.ediblewildfood.com/images/wild-violet-pictures/wild-violets.jpg",
         "description":"Wild violets are beautiful when in bloom but as the temperatures warm up the flowers tend to wilt and die off by the heat of the summer. These flowers tend to start growing in shady areas and spread to sunnier locations should the conditions be favourable. This edible plant is not liked in many areas as it can take over a lawn. They freely self-seed to the point of being weedy in optimum growing conditions. In addition to being edible this plant has several medicinal properties as well.",
         "edibleParts":"Edible parts: Violet flowers and leaves are edible with the leaves having a high level of vitamins A and C. They can be used in salads or cooked as greens. The flowers can be made into jellies, candied, or tossed into a salad.",
         "recipes":[
            {
               "recipeName":"Wild Violet Jelly",
               "recipeName_url":"http://www.ediblewildfood.com/wild-violet-jelly.aspx"
            }
         ]
      },
      {
         "commonName":"Wood Sorrel",
         "scientificName":"Oxalis stricta",
         "image":"http://www.ediblewildfood.com/images/wood-sorrel-pictures/wood-sorrel.jpg",
         "description":"Wood sorrel, or oxalis, is a medium-sized wild edible weed that thrives in most areas across Canada and the U.S. The flowers of this plant can be used to obtain yellow, orange, and red to brown dyes. Oxalis, another common name for this plant, literally means \"sour\" and is named as such due to its oxalic acid content. Many domesticated vegetables, including spinach and broccoli, also contain oxalic acid, which is considered toxic when consumed in large quantities because it inhibits the absorption of calcium. Oxalic acid is not considered a problem when consumed moderately and with a varied diet, however people with gout, rheumatism, arthritis, hyperacidity and kidney stones should avoid it.",
         "edibleParts":"Edible parts: Wood sorrel is an incredible thirst quencher and is refreshing to eat. The leaves, flowers, and immature green seed pods are all edible having a mild sour flavour that some say resemble lemons. Wood sorrel can be added to salads, used in soups, sauces and it can also be used as a seasoning. Wood sorrel tea when cooled can make a refreshing beverage especially when sweetened with honey. In moderate dosages, wood sorrel is cooling (refrigerant, febrifuge), diuretic, stomachic (soothing to the stomach, relieves indigestion), astringent, and catalytic.",
         "recipes":[
            {
               "recipeName":"Wood Sorrel and Onion Tart",
               "recipeName_url":"http://www.ediblewildfood.com/wood-sorrel-and-onion-tart.aspx"
            }
         ]
      },
      {
         "commonName":"Yellow Dock",
         "scientificName":"Rumex crispus",
         "image":"http://www.ediblewildfood.com/images/yellow-dock-pictures/yellow-dock.jpg",
         "description":"Yellow dock has been used as a multi-purpose plant for centuries. The aerial parts are a food source and the roots have strong medicinal values. The seeds are useful and interestingly, yellow dock seeds are viable for up to 80 years. Yellow dock is an ingredient in some herbal toothpastes. This plant is also known as curled dock, narrow dock and curly leaf dock.\nCaution: The leaves usually contain high levels of oxalic acid. In very small quantities they can be eaten raw; eating large quantities means that the oxalic acid can lock-up other nutrients in the food, especially calcium, thus causing mineral deficiencies. The oxalic acid content will be greatly reduced if the plant is cooked. If you have any medical conditions, consult a health professional before you eat the leaves.",
         "edibleParts":"Edible parts: Leaves in very small quantities can be eaten raw until the flower spikes appear. Yellow dock’s leaves can be cooked at any time so long as they are green. Leaves can be added to salads, cooked as a potherb or added to soups and stews. Stems can be consumed raw or cooked but they are best peeled and the inner portion consumed. Seeds can be eaten raw or cooked once they are brown. Yellow dock seeds can be used as a coffee substitute. The root contains the most medicinal properties; it can be boiled to make a bitter tea that detoxifies, helps the liver or skin ailments, and is used as a laxative.",
         "recipes":[
            {
               "recipeName":"Yellow Dock Crackers",
               "recipeName_url":"http://www.ediblewildfood.com/yellow-dock-crackers.aspx"
            }
         ]
      },
      {
         "commonName":"Yellow Rocket",
         "scientificName":"Barbarea vulgaris",
         "image":"http://www.ediblewildfood.com/images/yellow-rocket-pictures/yellow-rocket.jpg",
         "description":"Yellow rocket is a perennial that flowers from May to August and adds colour to fields, gardens and roadsides. This plant is often confused with wild mustard but it can be distinguished from wild mustard by its smaller, deeper golden yellow flowers, hairless leaves that are a glossy green or may even be slightly purplish in colour, the large terminal lobe within the leaves. If the winter season is not too severe, this plant can be found and collected throughout the winter. Sometimes it even stays green underneath the snow.",
         "edibleParts":"Edible parts: The basal leaves are edible early spring but later become bitter, although still edible. At this stage they can be chopped up and added to salads like rucola, which has a similar tang. The leaves can be cut up fresh over salads, older leaves can be used in stews or soups, or you can dry the leaves to make tea. Flowering stems can be cooked like broccoli.",
         "recipes":[
            {
               "recipeName":"Yellow Rocket Soup",
               "recipeName_url":"http://www.ediblewildfood.com/yellow-rocket-soup.aspx"
            }
         ]
      },
      {
         "commonName":"Yellow Toadflax",
         "scientificName":"Linaria vulgaris",
         "image":"http://www.ediblewildfood.com/images/yellow-toadflax-pictures/yellow-toadlax-flowers.jpg",
         "description":"Yellow toadflax was first introduced to North America by a Welsh Quaker as an ornamental plant. In addition to its beauty, it was also used for creating yellow dye, and as a lotion to help heal insect bites. This is a short-lived perennial that some people consider invasive while others welcome the beauty of this medicinal plant. Interestingly, when boiled in milk, the plant is said to yield an excellent fly poison; and an old country custom in parts of Sweden is to leave this milk infusion where flies are troublesome.",
         "edibleParts":"Edible parts: The young shoots can be cooked; as well the flowers and leaves can be consumed dried or fresh. Use with caution, consume only small amounts at a time. When fresh, yellow toadflax has a peculiar, heavy, disagreeable smell which dissipates by drying. It has a weakly saline, bitter and slightly acrid taste.",
         "recipes":[
            {

            }
         ]
      }
   ]
}
